trol73/avr-make/asm/include/m256RFR2def.inc
;***** THIS IS A MACHINE GENERATED FILE - DO NOT EDIT ********************
;***** Created: 2011-08-24 16:45 ******* Source: ATmega256RFR2.xml *******
;*************************************************************************
;* A P P L I C A T I O N   N O T E   F O R   T H E   A V R   F A M I L Y
;* 
;* Number            : AVR000
;* File Name         : "m256RFR2def.inc"
;* Title             : Register/Bit Definitions for the ATmega256RFR2
;* Date              : 2011-08-24
;* Version           : 2.35
;* Support E-mail    : avr@atmel.com
;* Target MCU        : ATmega256RFR2
;* 
;* DESCRIPTION
;* When including this file in the assembly program file, all I/O register 
;* names and I/O register bit names appearing in the data book can be used.
;* In addition, the six registers forming the three data pointers X, Y and 
;* Z have been assigned names XL - ZH. Highest RAM address for Internal 
;* SRAM is also defined 
;* 
;* The Register names are represented by their hexadecimal address.
;* 
;* The Register Bit names are represented by their bit number (0-7).
;* 
;* Please observe the difference in using the bit names with instructions
;* such as "sbr"/"cbr" (set/clear bit in register) and "sbrs"/"sbrc"
;* (skip if bit in register set/cleared). The following example illustrates
;* this:
;* 
;* in    r16,PORTB             ;read PORTB latch
;* sbr   r16,(1<<PB6)+(1<<PB5) ;set PB6 and PB5 (use masks, not bit#)
;* out   PORTB,r16             ;output to PORTB
;* 
;* in    r16,TIFR              ;read the Timer Interrupt Flag Register
;* sbrc  r16,TOV0              ;test the overflow flag (use bit#)
;* rjmp  TOV0_is_set           ;jump if set
;* ...                         ;otherwise do something else
;*************************************************************************

#ifndef _M256RFR2DEF_INC_
#define _M256RFR2DEF_INC_


#pragma partinc 0

; ***** SPECIFY DEVICE ***************************************************
.device ATmega256RFR2
#pragma AVRPART ADMIN PART_NAME ATmega256RFR2
.equ	SIGNATURE_000	= 0x1e
.equ	SIGNATURE_001	= 0xa8
.equ	SIGNATURE_002	= 0x02

#pragma AVRPART CORE CORE_VERSION V3


; ***** I/O REGISTER DEFINITIONS *****************************************
; NOTE:
; Definitions marked "MEMORY MAPPED"are extended I/O ports
; and cannot be used with IN/OUT instructions
.equ	TRXFBEND	= 0x1ff	; MEMORY MAPPED
.equ	TRXFBST	= 0x180	; MEMORY MAPPED
.equ	TST_RX_LENGTH	= 0x17b	; MEMORY MAPPED
.equ	TST_CTRL_DIGI	= 0x176	; MEMORY MAPPED
.equ	CSMA_BE	= 0x16f	; MEMORY MAPPED
.equ	CSMA_SEED_1	= 0x16e	; MEMORY MAPPED
.equ	CSMA_SEED_0	= 0x16d	; MEMORY MAPPED
.equ	XAH_CTRL_0	= 0x16c	; MEMORY MAPPED
.equ	IEEE_ADDR_7	= 0x16b	; MEMORY MAPPED
.equ	IEEE_ADDR_6	= 0x16a	; MEMORY MAPPED
.equ	IEEE_ADDR_5	= 0x169	; MEMORY MAPPED
.equ	IEEE_ADDR_4	= 0x168	; MEMORY MAPPED
.equ	IEEE_ADDR_3	= 0x167	; MEMORY MAPPED
.equ	IEEE_ADDR_2	= 0x166	; MEMORY MAPPED
.equ	IEEE_ADDR_1	= 0x165	; MEMORY MAPPED
.equ	IEEE_ADDR_0	= 0x164	; MEMORY MAPPED
.equ	PAN_ID_1	= 0x163	; MEMORY MAPPED
.equ	PAN_ID_0	= 0x162	; MEMORY MAPPED
.equ	SHORT_ADDR_1	= 0x161	; MEMORY MAPPED
.equ	SHORT_ADDR_0	= 0x160	; MEMORY MAPPED
.equ	MAN_ID_1	= 0x15f	; MEMORY MAPPED
.equ	MAN_ID_0	= 0x15e	; MEMORY MAPPED
.equ	VERSION_NUM	= 0x15d	; MEMORY MAPPED
.equ	PART_NUM	= 0x15c	; MEMORY MAPPED
.equ	PLL_DCU	= 0x15b	; MEMORY MAPPED
.equ	PLL_CF	= 0x15a	; MEMORY MAPPED
.equ	FTN_CTRL	= 0x158	; MEMORY MAPPED
.equ	XAH_CTRL_1	= 0x157	; MEMORY MAPPED
.equ	TRX_RPC	= 0x156	; MEMORY MAPPED
.equ	RX_SYN	= 0x155	; MEMORY MAPPED
.equ	CC_CTRL_1	= 0x154	; MEMORY MAPPED
.equ	CC_CTRL_0	= 0x153	; MEMORY MAPPED
.equ	XOSC_CTRL	= 0x152	; MEMORY MAPPED
.equ	BATMON	= 0x151	; MEMORY MAPPED
.equ	VREG_CTRL	= 0x150	; MEMORY MAPPED
.equ	IRQ_STATUS	= 0x14f	; MEMORY MAPPED
.equ	IRQ_MASK	= 0x14e	; MEMORY MAPPED
.equ	ANT_DIV	= 0x14d	; MEMORY MAPPED
.equ	TRX_CTRL_2	= 0x14c	; MEMORY MAPPED
.equ	SFD_VALUE	= 0x14b	; MEMORY MAPPED
.equ	RX_CTRL	= 0x14a	; MEMORY MAPPED
.equ	CCA_THRES	= 0x149	; MEMORY MAPPED
.equ	PHY_CC_CCA	= 0x148	; MEMORY MAPPED
.equ	PHY_ED_LEVEL	= 0x147	; MEMORY MAPPED
.equ	PHY_RSSI	= 0x146	; MEMORY MAPPED
.equ	PHY_TX_PWR	= 0x145	; MEMORY MAPPED
.equ	TRX_CTRL_1	= 0x144	; MEMORY MAPPED
.equ	TRX_CTRL_0	= 0x143	; MEMORY MAPPED
.equ	TRX_STATE	= 0x142	; MEMORY MAPPED
.equ	TRX_STATUS	= 0x141	; MEMORY MAPPED
.equ	AES_KEY	= 0x13f	; MEMORY MAPPED
.equ	AES_STATE	= 0x13e	; MEMORY MAPPED
.equ	AES_STATUS	= 0x13d	; MEMORY MAPPED
.equ	AES_CTRL	= 0x13c	; MEMORY MAPPED
.equ	TRXPR	= 0x139	; MEMORY MAPPED
.equ	PARCR	= 0x138	; MEMORY MAPPED
.equ	DPDS1	= 0x137	; MEMORY MAPPED
.equ	DPDS0	= 0x136	; MEMORY MAPPED
.equ	DRTRAM0	= 0x135	; MEMORY MAPPED
.equ	DRTRAM1	= 0x134	; MEMORY MAPPED
.equ	DRTRAM2	= 0x133	; MEMORY MAPPED
.equ	DRTRAM3	= 0x132	; MEMORY MAPPED
.equ	LLDRH	= 0x131	; MEMORY MAPPED
.equ	LLDRL	= 0x130	; MEMORY MAPPED
.equ	LLCR	= 0x12f	; MEMORY MAPPED
.equ	OCR5CL	= 0x12c	; MEMORY MAPPED
.equ	OCR5CH	= 0x12d	; MEMORY MAPPED
.equ	OCR5BL	= 0x12a	; MEMORY MAPPED
.equ	OCR5BH	= 0x12b	; MEMORY MAPPED
.equ	OCR5AL	= 0x128	; MEMORY MAPPED
.equ	OCR5AH	= 0x129	; MEMORY MAPPED
.equ	ICR5H	= 0x127	; MEMORY MAPPED
.equ	ICR5L	= 0x126	; MEMORY MAPPED
.equ	TCNT5L	= 0x124	; MEMORY MAPPED
.equ	TCNT5H	= 0x125	; MEMORY MAPPED
.equ	TCCR5C	= 0x122	; MEMORY MAPPED
.equ	TCCR5B	= 0x121	; MEMORY MAPPED
.equ	TCCR5A	= 0x120	; MEMORY MAPPED
.equ	MAFPA3H	= 0x11d	; MEMORY MAPPED
.equ	MAFPA3L	= 0x11c	; MEMORY MAPPED
.equ	MAFSA3H	= 0x11b	; MEMORY MAPPED
.equ	MAFSA3L	= 0x11a	; MEMORY MAPPED
.equ	MAFPA2H	= 0x119	; MEMORY MAPPED
.equ	MAFPA2L	= 0x118	; MEMORY MAPPED
.equ	MAFSA2H	= 0x117	; MEMORY MAPPED
.equ	MAFSA2L	= 0x116	; MEMORY MAPPED
.equ	MAFPA1H	= 0x115	; MEMORY MAPPED
.equ	MAFPA1L	= 0x114	; MEMORY MAPPED
.equ	MAFSA1H	= 0x113	; MEMORY MAPPED
.equ	MAFSA1L	= 0x112	; MEMORY MAPPED
.equ	MAFPA0H	= 0x111	; MEMORY MAPPED
.equ	MAFPA0L	= 0x110	; MEMORY MAPPED
.equ	MAFSA0H	= 0x10f	; MEMORY MAPPED
.equ	MAFSA0L	= 0x10e	; MEMORY MAPPED
.equ	MAFCR1	= 0x10d	; MEMORY MAPPED
.equ	MAFCR0	= 0x10c	; MEMORY MAPPED
.equ	PORTL	= 0x10b	; MEMORY MAPPED
.equ	DDRL	= 0x10a	; MEMORY MAPPED
.equ	PINL	= 0x109	; MEMORY MAPPED
.equ	PORTK	= 0x108	; MEMORY MAPPED
.equ	DDRK	= 0x107	; MEMORY MAPPED
.equ	PINK	= 0x106	; MEMORY MAPPED
.equ	PORTJ	= 0x105	; MEMORY MAPPED
.equ	DDRJ	= 0x104	; MEMORY MAPPED
.equ	PINJ	= 0x103	; MEMORY MAPPED
.equ	PORTH	= 0x102	; MEMORY MAPPED
.equ	DDRH	= 0x101	; MEMORY MAPPED
.equ	PINH	= 0x100	; MEMORY MAPPED
.equ	SCTSTRHH	= 0xfc	; MEMORY MAPPED
.equ	SCTSTRHL	= 0xfb	; MEMORY MAPPED
.equ	SCTSTRLH	= 0xfa	; MEMORY MAPPED
.equ	SCTSTRLL	= 0xf9	; MEMORY MAPPED
.equ	SCOCR1HH	= 0xf8	; MEMORY MAPPED
.equ	SCOCR1HL	= 0xf7	; MEMORY MAPPED
.equ	SCOCR1LH	= 0xf6	; MEMORY MAPPED
.equ	SCOCR1LL	= 0xf5	; MEMORY MAPPED
.equ	SCOCR2HH	= 0xf4	; MEMORY MAPPED
.equ	SCOCR2HL	= 0xf3	; MEMORY MAPPED
.equ	SCOCR2LH	= 0xf2	; MEMORY MAPPED
.equ	SCOCR2LL	= 0xf1	; MEMORY MAPPED
.equ	SCOCR3HH	= 0xf0	; MEMORY MAPPED
.equ	SCOCR3HL	= 0xef	; MEMORY MAPPED
.equ	SCOCR3LH	= 0xee	; MEMORY MAPPED
.equ	SCOCR3LL	= 0xed	; MEMORY MAPPED
.equ	SCTSRHH	= 0xec	; MEMORY MAPPED
.equ	SCTSRHL	= 0xeb	; MEMORY MAPPED
.equ	SCTSRLH	= 0xea	; MEMORY MAPPED
.equ	SCTSRLL	= 0xe9	; MEMORY MAPPED
.equ	SCBTSRHH	= 0xe8	; MEMORY MAPPED
.equ	SCBTSRHL	= 0xe7	; MEMORY MAPPED
.equ	SCBTSRLH	= 0xe6	; MEMORY MAPPED
.equ	SCBTSRLL	= 0xe5	; MEMORY MAPPED
.equ	SCCNTHH	= 0xe4	; MEMORY MAPPED
.equ	SCCNTHL	= 0xe3	; MEMORY MAPPED
.equ	SCCNTLH	= 0xe2	; MEMORY MAPPED
.equ	SCCNTLL	= 0xe1	; MEMORY MAPPED
.equ	SCIRQS	= 0xe0	; MEMORY MAPPED
.equ	SCIRQM	= 0xdf	; MEMORY MAPPED
.equ	SCSR	= 0xde	; MEMORY MAPPED
.equ	SCCR1	= 0xdd	; MEMORY MAPPED
.equ	SCCR0	= 0xdc	; MEMORY MAPPED
.equ	SCCSR	= 0xdb	; MEMORY MAPPED
.equ	SCRSTRHH	= 0xda	; MEMORY MAPPED
.equ	SCRSTRHL	= 0xd9	; MEMORY MAPPED
.equ	SCRSTRLH	= 0xd8	; MEMORY MAPPED
.equ	SCRSTRLL	= 0xd7	; MEMORY MAPPED
.equ	ATBR33	= 0xd1	; MEMORY MAPPED
.equ	ATBR18	= 0xd0	; MEMORY MAPPED
.equ	UDR1	= 0xce	; MEMORY MAPPED
.equ	UBRR1L	= 0xcc	; MEMORY MAPPED
.equ	UBRR1H	= 0xcd	; MEMORY MAPPED
.equ	UCSR1C	= 0xca	; MEMORY MAPPED
.equ	UCSR1B	= 0xc9	; MEMORY MAPPED
.equ	UCSR1A	= 0xc8	; MEMORY MAPPED
.equ	UDR0	= 0xc6	; MEMORY MAPPED
.equ	UBRR0L	= 0xc4	; MEMORY MAPPED
.equ	UBRR0H	= 0xc5	; MEMORY MAPPED
.equ	UCSR0C	= 0xc2	; MEMORY MAPPED
.equ	UCSR0B	= 0xc1	; MEMORY MAPPED
.equ	UCSR0A	= 0xc0	; MEMORY MAPPED
.equ	IRQ_STATUS1	= 0xbf	; MEMORY MAPPED
.equ	IRQ_MASK1	= 0xbe	; MEMORY MAPPED
.equ	TWAMR	= 0xbd	; MEMORY MAPPED
.equ	TWCR	= 0xbc	; MEMORY MAPPED
.equ	TWDR	= 0xbb	; MEMORY MAPPED
.equ	TWAR	= 0xba	; MEMORY MAPPED
.equ	TWSR	= 0xb9	; MEMORY MAPPED
.equ	TWBR	= 0xb8	; MEMORY MAPPED
.equ	ASSR	= 0xb6	; MEMORY MAPPED
.equ	OCR2B	= 0xb4	; MEMORY MAPPED
.equ	OCR2A	= 0xb3	; MEMORY MAPPED
.equ	TCNT2	= 0xb2	; MEMORY MAPPED
.equ	TCCR2B	= 0xb1	; MEMORY MAPPED
.equ	TCCR2A	= 0xb0	; MEMORY MAPPED
.equ	OCR4CL	= 0xac	; MEMORY MAPPED
.equ	OCR4CH	= 0xad	; MEMORY MAPPED
.equ	OCR4BL	= 0xaa	; MEMORY MAPPED
.equ	OCR4BH	= 0xab	; MEMORY MAPPED
.equ	OCR4AL	= 0xa8	; MEMORY MAPPED
.equ	OCR4AH	= 0xa9	; MEMORY MAPPED
.equ	ICR4L	= 0xa6	; MEMORY MAPPED
.equ	ICR4H	= 0xa7	; MEMORY MAPPED
.equ	TCNT4L	= 0xa4	; MEMORY MAPPED
.equ	TCNT4H	= 0xa5	; MEMORY MAPPED
.equ	TCCR4C	= 0xa2	; MEMORY MAPPED
.equ	TCCR4B	= 0xa1	; MEMORY MAPPED
.equ	TCCR4A	= 0xa0	; MEMORY MAPPED
.equ	OCR3CL	= 0x9c	; MEMORY MAPPED
.equ	OCR3CH	= 0x9d	; MEMORY MAPPED
.equ	OCR3BL	= 0x9a	; MEMORY MAPPED
.equ	OCR3BH	= 0x9b	; MEMORY MAPPED
.equ	OCR3AL	= 0x98	; MEMORY MAPPED
.equ	OCR3AH	= 0x99	; MEMORY MAPPED
.equ	ICR3L	= 0x96	; MEMORY MAPPED
.equ	ICR3H	= 0x97	; MEMORY MAPPED
.equ	TCNT3L	= 0x94	; MEMORY MAPPED
.equ	TCNT3H	= 0x95	; MEMORY MAPPED
.equ	TCCR3C	= 0x92	; MEMORY MAPPED
.equ	TCCR3B	= 0x91	; MEMORY MAPPED
.equ	TCCR3A	= 0x90	; MEMORY MAPPED
.equ	OCR1CL	= 0x8c	; MEMORY MAPPED
.equ	OCR1CH	= 0x8d	; MEMORY MAPPED
.equ	OCR1BL	= 0x8a	; MEMORY MAPPED
.equ	OCR1BH	= 0x8b	; MEMORY MAPPED
.equ	OCR1AL	= 0x88	; MEMORY MAPPED
.equ	OCR1AH	= 0x89	; MEMORY MAPPED
.equ	ICR1L	= 0x86	; MEMORY MAPPED
.equ	ICR1H	= 0x87	; MEMORY MAPPED
.equ	TCNT1L	= 0x84	; MEMORY MAPPED
.equ	TCNT1H	= 0x85	; MEMORY MAPPED
.equ	TCCR1C	= 0x82	; MEMORY MAPPED
.equ	TCCR1B	= 0x81	; MEMORY MAPPED
.equ	TCCR1A	= 0x80	; MEMORY MAPPED
.equ	DIDR1	= 0x7f	; MEMORY MAPPED
.equ	DIDR0	= 0x7e	; MEMORY MAPPED
.equ	DIDR2	= 0x7d	; MEMORY MAPPED
.equ	ADMUX	= 0x7c	; MEMORY MAPPED
.equ	ADCSRB	= 0x7b	; MEMORY MAPPED
.equ	ADCSRA	= 0x7a	; MEMORY MAPPED
.equ	ADCH	= 0x79	; MEMORY MAPPED
.equ	ADCL	= 0x78	; MEMORY MAPPED
.equ	ADCSRC	= 0x77	; MEMORY MAPPED
.equ	NEMCR	= 0x75	; MEMORY MAPPED
.equ	TIMSK5	= 0x73	; MEMORY MAPPED
.equ	TIMSK4	= 0x72	; MEMORY MAPPED
.equ	TIMSK3	= 0x71	; MEMORY MAPPED
.equ	TIMSK2	= 0x70	; MEMORY MAPPED
.equ	TIMSK1	= 0x6f	; MEMORY MAPPED
.equ	TIMSK0	= 0x6e	; MEMORY MAPPED
.equ	PCMSK2	= 0x6d	; MEMORY MAPPED
.equ	PCMSK1	= 0x6c	; MEMORY MAPPED
.equ	PCMSK0	= 0x6b	; MEMORY MAPPED
.equ	EICRB	= 0x6a	; MEMORY MAPPED
.equ	EICRA	= 0x69	; MEMORY MAPPED
.equ	PCICR	= 0x68	; MEMORY MAPPED
.equ	BGCR	= 0x67	; MEMORY MAPPED
.equ	OSCCAL	= 0x66	; MEMORY MAPPED
.equ	PRR1	= 0x65	; MEMORY MAPPED
.equ	PRR0	= 0x64	; MEMORY MAPPED
.equ	PRR2	= 0x63	; MEMORY MAPPED
.equ	CLKPR	= 0x61	; MEMORY MAPPED
.equ	WDTCSR	= 0x60	; MEMORY MAPPED
.equ	SREG	= 0x3f
.equ	SPL	= 0x3d
.equ	SPH	= 0x3e
.equ	EIND	= 0x3c
.equ	RAMPZ	= 0x3b
.equ	SPMCSR	= 0x37
.equ	MCUCR	= 0x35
.equ	MCUSR	= 0x34
.equ	SMCR	= 0x33
.equ	OCDR	= 0x31
.equ	ACSR	= 0x30
.equ	SPDR	= 0x2e
.equ	SPSR	= 0x2d
.equ	SPCR	= 0x2c
.equ	GPIOR2	= 0x2b
.equ	GPIOR1	= 0x2a
.equ	OCR0B	= 0x28
.equ	OCR0A	= 0x27
.equ	TCNT0	= 0x26
.equ	TCCR0B	= 0x25
.equ	TCCR0A	= 0x24
.equ	GTCCR	= 0x23
.equ	EEARH	= 0x22
.equ	EEARL	= 0x21
.equ	EEDR	= 0x20
.equ	EECR	= 0x1f
.equ	GPIOR0	= 0x1e
.equ	EIMSK	= 0x1d
.equ	EIFR	= 0x1c
.equ	PCIFR	= 0x1b
.equ	TIFR5	= 0x1a
.equ	TIFR4	= 0x19
.equ	TIFR3	= 0x18
.equ	TIFR2	= 0x17
.equ	TIFR1	= 0x16
.equ	TIFR0	= 0x15
.equ	PORTG	= 0x14
.equ	DDRG	= 0x13
.equ	PING	= 0x12
.equ	PORTF	= 0x11
.equ	DDRF	= 0x10
.equ	PINF	= 0x0f
.equ	PORTE	= 0x0e
.equ	DDRE	= 0x0d
.equ	PINE	= 0x0c
.equ	PORTD	= 0x0b
.equ	DDRD	= 0x0a
.equ	PIND	= 0x09
.equ	PORTC	= 0x08
.equ	DDRC	= 0x07
.equ	PINC	= 0x06
.equ	PORTB	= 0x05
.equ	DDRB	= 0x04
.equ	PINB	= 0x03
.equ	PORTA	= 0x02
.equ	DDRA	= 0x01
.equ	PINA	= 0x00


; ***** BIT DEFINITIONS **************************************************

