trol73/avr-make/asm/include/m256RFR2def.inc
; ***** ANALOG_COMPARATOR ************
; ADCSRB - ADC Control and Status Register B
.equ	ACME	= 6	; Analog Comparator Multiplexer Enable

; ACSR - Analog Comparator Control And Status Register
.equ	ACIS0	= 0	; Analog Comparator Interrupt Mode Select
.equ	ACIS1	= 1	; Analog Comparator Interrupt Mode Select
.equ	ACIC	= 2	; Analog Comparator Input Capture Enable
.equ	ACIE	= 3	; Analog Comparator Interrupt Enable
.equ	ACI	= 4	; Analog Comparator Interrupt Flag
.equ	ACO	= 5	; Analog Compare Output
.equ	ACBG	= 6	; Analog Comparator Bandgap Select
.equ	ACD	= 7	; Analog Comparator Disable

; DIDR1 - Digital Input Disable Register 1
.equ	AIN0D	= 0	; AIN0 Digital Input Disable
.equ	AIN1D	= 1	; AIN1 Digital Input Disable


; ***** USART0 ***********************
; UDR0 - USART0 I/O Data Register
.equ	UDR00	= 0	; USART I/O Data Register
.equ	UDR01	= 1	; USART I/O Data Register
.equ	UDR02	= 2	; USART I/O Data Register
.equ	UDR03	= 3	; USART I/O Data Register
.equ	UDR04	= 4	; USART I/O Data Register
.equ	UDR05	= 5	; USART I/O Data Register
.equ	UDR06	= 6	; USART I/O Data Register
.equ	UDR07	= 7	; USART I/O Data Register

; UCSR0A - USART0 Control and Status Register A
.equ	MPCM0	= 0	; Multi-processor Communication Mode
.equ	U2X0	= 1	; Double the USART Transmission Speed
.equ	UPE0	= 2	; USART Parity Error
.equ	DOR0	= 3	; Data OverRun
.equ	FE0	= 4	; Frame Error
.equ	UDRE0	= 5	; USART Data Register Empty
.equ	TXC0	= 6	; USART Transmit Complete
.equ	RXC0	= 7	; USART Receive Complete

; UCSR0B - USART0 Control and Status Register B
.equ	TXB80	= 0	; Transmit Data Bit 8
.equ	RXB80	= 1	; Receive Data Bit 8
.equ	UCSZ02	= 2	; Character Size
.equ	TXEN0	= 3	; Transmitter Enable
.equ	RXEN0	= 4	; Receiver Enable
.equ	UDRIE0	= 5	; USART Data Register Empty Interrupt Enable
.equ	TXCIE0	= 6	; TX Complete Interrupt Enable
.equ	RXCIE0	= 7	; RX Complete Interrupt Enable

; UCSR0C - USART0 Control and Status Register C
.equ	UCPOL0	= 0	; Clock Polarity
.equ	UCSZ00	= 1	; Character Size
.equ	UCPHA0	= UCSZ00	; For compatibility
.equ	UCSZ01	= 2	; Character Size
.equ	UDORD0	= UCSZ01	; For compatibility
.equ	USBS0	= 3	; Stop Bit Select
.equ	UPM00	= 4	; Parity Mode
.equ	UPM01	= 5	; Parity Mode
.equ	UMSEL00	= 6	; USART Mode Select
.equ	UMSEL0	= UMSEL00	; For compatibility
.equ	UMSEL01	= 7	; USART Mode Select
.equ	UMSEL1	= UMSEL01	; For compatibility

; UBRR0H - USART0 Baud Rate Register High Byte
.equ	UBRR8	= 0	; USART Baud Rate Register
.equ	UBRR9	= 1	; USART Baud Rate Register
.equ	UBRR10	= 2	; USART Baud Rate Register
.equ	UBRR11	= 3	; USART Baud Rate Register
.equ	Res0	= 4	; Reserved Bit
.equ	Res1	= 5	; Reserved Bit
.equ	Res2	= 6	; Reserved Bit
.equ	Res3	= 7	; Reserved Bit

; UBRR0L - USART0 Baud Rate Register Low Byte
.equ	UBRR0	= 0	; USART Baud Rate Register
.equ	UBRR1	= 1	; USART Baud Rate Register
.equ	UBRR2	= 2	; USART Baud Rate Register
.equ	UBRR3	= 3	; USART Baud Rate Register
.equ	UBRR4	= 4	; USART Baud Rate Register
.equ	UBRR5	= 5	; USART Baud Rate Register
.equ	UBRR6	= 6	; USART Baud Rate Register
.equ	UBRR7	= 7	; USART Baud Rate Register


; ***** USART1 ***********************
; UDR1 - USART1 I/O Data Register
.equ	UDR10	= 0	; USART I/O Data Register
.equ	UDR11	= 1	; USART I/O Data Register
.equ	UDR12	= 2	; USART I/O Data Register
.equ	UDR13	= 3	; USART I/O Data Register
.equ	UDR14	= 4	; USART I/O Data Register
.equ	UDR15	= 5	; USART I/O Data Register
.equ	UDR16	= 6	; USART I/O Data Register
.equ	UDR17	= 7	; USART I/O Data Register

; UCSR1A - USART1 Control and Status Register A
.equ	MPCM1	= 0	; Multi-processor Communication Mode
.equ	U2X1	= 1	; Double the USART Transmission Speed
.equ	UPE1	= 2	; USART Parity Error
.equ	DOR1	= 3	; Data OverRun
.equ	FE1	= 4	; Frame Error
.equ	UDRE1	= 5	; USART Data Register Empty
.equ	TXC1	= 6	; USART Transmit Complete
.equ	RXC1	= 7	; USART Receive Complete

; UCSR1B - USART1 Control and Status Register B
.equ	TXB81	= 0	; Transmit Data Bit 8
.equ	RXB81	= 1	; Receive Data Bit 8
.equ	UCSZ12	= 2	; Character Size
.equ	TXEN1	= 3	; Transmitter Enable
.equ	RXEN1	= 4	; Receiver Enable
.equ	UDRIE1	= 5	; USART Data Register Empty Interrupt Enable
.equ	TXCIE1	= 6	; TX Complete Interrupt Enable
.equ	RXCIE1	= 7	; RX Complete Interrupt Enable

; UCSR1C - USART1 Control and Status Register C
.equ	UCPOL1	= 0	; Clock Polarity
.equ	UCSZ10	= 1	; Character Size
.equ	UCPHA1	= UCSZ10	; For compatibility
.equ	UCSZ11	= 2	; Character Size
.equ	UDORD1	= UCSZ11	; For compatibility
.equ	USBS1	= 3	; Stop Bit Select
.equ	UPM10	= 4	; Parity Mode
.equ	UPM11	= 5	; Parity Mode
.equ	UMSEL10	= 6	; USART Mode Select
.equ	UMSEL11	= 7	; USART Mode Select

; UBRR1H - USART1 Baud Rate Register High Byte
;.equ	UBRR8	= 0	; USART Baud Rate Register
;.equ	UBRR9	= 1	; USART Baud Rate Register
;.equ	UBRR10	= 2	; USART Baud Rate Register
;.equ	UBRR11	= 3	; USART Baud Rate Register
;.equ	Res0	= 4	; Reserved Bit
;.equ	Res1	= 5	; Reserved Bit
;.equ	Res2	= 6	; Reserved Bit
;.equ	Res3	= 7	; Reserved Bit

; UBRR1L - USART1 Baud Rate Register Low Byte
;.equ	UBRR0	= 0	; USART Baud Rate Register
;.equ	UBRR1	= 1	; USART Baud Rate Register
;.equ	UBRR2	= 2	; USART Baud Rate Register
;.equ	UBRR3	= 3	; USART Baud Rate Register
;.equ	UBRR4	= 4	; USART Baud Rate Register
;.equ	UBRR5	= 5	; USART Baud Rate Register
;.equ	UBRR6	= 6	; USART Baud Rate Register
;.equ	UBRR7	= 7	; USART Baud Rate Register


; ***** TWI **************************
; TWAMR - TWI (Slave) Address Mask Register
.equ	Res	= 0	; Reserved Bit
.equ	TWAM0	= 1	; TWI Address Mask
.equ	TWAMR0	= TWAM0	; For compatibility
.equ	TWAM1	= 2	; TWI Address Mask
.equ	TWAMR1	= TWAM1	; For compatibility
.equ	TWAM2	= 3	; TWI Address Mask
.equ	TWAMR2	= TWAM2	; For compatibility
.equ	TWAM3	= 4	; TWI Address Mask
.equ	TWAMR3	= TWAM3	; For compatibility
.equ	TWAM4	= 5	; TWI Address Mask
.equ	TWAMR4	= TWAM4	; For compatibility
.equ	TWAM5	= 6	; TWI Address Mask
.equ	TWAMR5	= TWAM5	; For compatibility
.equ	TWAM6	= 7	; TWI Address Mask
.equ	TWAMR6	= TWAM6	; For compatibility

; TWBR - TWI Bit Rate Register
.equ	TWBR0	= 0	; TWI Bit Rate Register Value
.equ	TWBR1	= 1	; TWI Bit Rate Register Value
.equ	TWBR2	= 2	; TWI Bit Rate Register Value
.equ	TWBR3	= 3	; TWI Bit Rate Register Value
.equ	TWBR4	= 4	; TWI Bit Rate Register Value
.equ	TWBR5	= 5	; TWI Bit Rate Register Value
.equ	TWBR6	= 6	; TWI Bit Rate Register Value
.equ	TWBR7	= 7	; TWI Bit Rate Register Value

; TWCR - TWI Control Register
.equ	TWIE	= 0	; TWI Interrupt Enable
;.equ	Res	= 1	; Reserved Bit
.equ	TWEN	= 2	; TWI Enable Bit
.equ	TWWC	= 3	; TWI Write Collision Flag
.equ	TWSTO	= 4	; TWI STOP Condition Bit
.equ	TWSTA	= 5	; TWI START Condition Bit
.equ	TWEA	= 6	; TWI Enable Acknowledge Bit
.equ	TWINT	= 7	; TWI Interrupt Flag

; TWSR - TWI Status Register
.equ	TWPS0	= 0	; TWI Prescaler Bits
.equ	TWPS1	= 1	; TWI Prescaler Bits
;.equ	Res	= 2	; Reserved Bit
.equ	TWS3	= 3	; TWI Status
.equ	TWS4	= 4	; TWI Status
.equ	TWS5	= 5	; TWI Status
.equ	TWS6	= 6	; TWI Status
.equ	TWS7	= 7	; TWI Status

; TWDR - TWI Data Register
.equ	TWD0	= 0	; TWI Data Register Byte
.equ	TWD1	= 1	; TWI Data Register Byte
.equ	TWD2	= 2	; TWI Data Register Byte
.equ	TWD3	= 3	; TWI Data Register Byte
.equ	TWD4	= 4	; TWI Data Register Byte
.equ	TWD5	= 5	; TWI Data Register Byte
.equ	TWD6	= 6	; TWI Data Register Byte
.equ	TWD7	= 7	; TWI Data Register Byte

