trol73/avr-make/asm/include/m256RFR2def.inc
; TWAR - TWI (Slave) Address Register
.equ	TWGCE	= 0	; TWI General Call Recognition Enable Bit
.equ	TWA0	= 1	; TWI (Slave) Address
.equ	TWA1	= 2	; TWI (Slave) Address
.equ	TWA2	= 3	; TWI (Slave) Address
.equ	TWA3	= 4	; TWI (Slave) Address
.equ	TWA4	= 5	; TWI (Slave) Address
.equ	TWA5	= 6	; TWI (Slave) Address
.equ	TWA6	= 7	; TWI (Slave) Address


; ***** SPI **************************
; SPDR - SPI Data Register
.equ	SPDR0	= 0	; SPI Data Register
.equ	SPDR1	= 1	; SPI Data Register
.equ	SPDR2	= 2	; SPI Data Register
.equ	SPDR3	= 3	; SPI Data Register
.equ	SPDR4	= 4	; SPI Data Register
.equ	SPDR5	= 5	; SPI Data Register
.equ	SPDR6	= 6	; SPI Data Register
.equ	SPDR7	= 7	; SPI Data Register

; SPSR - SPI Status Register
.equ	SPI2X	= 0	; Double SPI Speed Bit
;.equ	Res0	= 1	; Reserved
;.equ	Res1	= 2	; Reserved
;.equ	Res2	= 3	; Reserved
;.equ	Res3	= 4	; Reserved
.equ	Res4	= 5	; Reserved
.equ	WCOL	= 6	; Write Collision Flag
.equ	SPIF	= 7	; SPI Interrupt Flag

; SPCR - SPI Control Register
.equ	SPR0	= 0	; SPI Clock Rate Select 1 and 0
.equ	SPR1	= 1	; SPI Clock Rate Select 1 and 0
.equ	CPHA	= 2	; Clock Phase
.equ	CPOL	= 3	; Clock polarity
.equ	MSTR	= 4	; Master/Slave Select
.equ	DORD	= 5	; Data Order
.equ	SPE	= 6	; SPI Enable
.equ	SPIE	= 7	; SPI Interrupt Enable


; ***** PORTA ************************
; PORTA - Port A Data Register
.equ	PORTA0	= 0	; Port A Data Register Value
.equ	PA0	= 0	; For compatibility
.equ	PORTA1	= 1	; Port A Data Register Value
.equ	PA1	= 1	; For compatibility
.equ	PORTA2	= 2	; Port A Data Register Value
.equ	PA2	= 2	; For compatibility
.equ	PORTA3	= 3	; Port A Data Register Value
.equ	PA3	= 3	; For compatibility
.equ	PORTA4	= 4	; Port A Data Register Value
.equ	PA4	= 4	; For compatibility
.equ	PORTA5	= 5	; Port A Data Register Value
.equ	PA5	= 5	; For compatibility
.equ	PORTA6	= 6	; Port A Data Register Value
.equ	PA6	= 6	; For compatibility
.equ	PORTA7	= 7	; Port A Data Register Value
.equ	PA7	= 7	; For compatibility

; DDRA - Port A Data Direction Register
.equ	DDA0	= 0	; Port A Data Direction Register Value
.equ	DDA1	= 1	; Port A Data Direction Register Value
.equ	DDA2	= 2	; Port A Data Direction Register Value
.equ	DDA3	= 3	; Port A Data Direction Register Value
.equ	DDA4	= 4	; Port A Data Direction Register Value
.equ	DDA5	= 5	; Port A Data Direction Register Value
.equ	DDA6	= 6	; Port A Data Direction Register Value
.equ	DDA7	= 7	; Port A Data Direction Register Value

; PINA - Port A Input Pins Address
.equ	PINA0	= 0	; Port A Input Pins
.equ	PINA1	= 1	; Port A Input Pins
.equ	PINA2	= 2	; Port A Input Pins
.equ	PINA3	= 3	; Port A Input Pins
.equ	PINA4	= 4	; Port A Input Pins
.equ	PINA5	= 5	; Port A Input Pins
.equ	PINA6	= 6	; Port A Input Pins
.equ	PINA7	= 7	; Port A Input Pins


; ***** PORTB ************************
; PORTB - Port B Data Register
.equ	PORTB0	= 0	; Port B Data Register Value
.equ	PB0	= 0	; For compatibility
.equ	PORTB1	= 1	; Port B Data Register Value
.equ	PB1	= 1	; For compatibility
.equ	PORTB2	= 2	; Port B Data Register Value
.equ	PB2	= 2	; For compatibility
.equ	PORTB3	= 3	; Port B Data Register Value
.equ	PB3	= 3	; For compatibility
.equ	PORTB4	= 4	; Port B Data Register Value
.equ	PB4	= 4	; For compatibility
.equ	PORTB5	= 5	; Port B Data Register Value
.equ	PB5	= 5	; For compatibility
.equ	PORTB6	= 6	; Port B Data Register Value
.equ	PB6	= 6	; For compatibility
.equ	PORTB7	= 7	; Port B Data Register Value
.equ	PB7	= 7	; For compatibility

; DDRB - Port B Data Direction Register
.equ	DDB0	= 0	; Port B Data Direction Register Value
.equ	DDB1	= 1	; Port B Data Direction Register Value
.equ	DDB2	= 2	; Port B Data Direction Register Value
.equ	DDB3	= 3	; Port B Data Direction Register Value
.equ	DDB4	= 4	; Port B Data Direction Register Value
.equ	DDB5	= 5	; Port B Data Direction Register Value
.equ	DDB6	= 6	; Port B Data Direction Register Value
.equ	DDB7	= 7	; Port B Data Direction Register Value

; PINB - Port B Input Pins Address
.equ	PINB0	= 0	; Port B Input Pins Value
.equ	PINB1	= 1	; Port B Input Pins Value
.equ	PINB2	= 2	; Port B Input Pins Value
.equ	PINB3	= 3	; Port B Input Pins Value
.equ	PINB4	= 4	; Port B Input Pins Value
.equ	PINB5	= 5	; Port B Input Pins Value
.equ	PINB6	= 6	; Port B Input Pins Value
.equ	PINB7	= 7	; Port B Input Pins Value


; ***** PORTC ************************
; PORTC - Port C Data Register
.equ	PORTC0	= 0	; Port C Data Register Value
.equ	PC0	= 0	; For compatibility
.equ	PORTC1	= 1	; Port C Data Register Value
.equ	PC1	= 1	; For compatibility
.equ	PORTC2	= 2	; Port C Data Register Value
.equ	PC2	= 2	; For compatibility
.equ	PORTC3	= 3	; Port C Data Register Value
.equ	PC3	= 3	; For compatibility
.equ	PORTC4	= 4	; Port C Data Register Value
.equ	PC4	= 4	; For compatibility
.equ	PORTC5	= 5	; Port C Data Register Value
.equ	PC5	= 5	; For compatibility
.equ	PORTC6	= 6	; Port C Data Register Value
.equ	PC6	= 6	; For compatibility
.equ	PORTC7	= 7	; Port C Data Register Value
.equ	PC7	= 7	; For compatibility

; DDRC - Port C Data Direction Register
.equ	DDC0	= 0	; Port C Data Direction Register Value
.equ	DDC1	= 1	; Port C Data Direction Register Value
.equ	DDC2	= 2	; Port C Data Direction Register Value
.equ	DDC3	= 3	; Port C Data Direction Register Value
.equ	DDC4	= 4	; Port C Data Direction Register Value
.equ	DDC5	= 5	; Port C Data Direction Register Value
.equ	DDC6	= 6	; Port C Data Direction Register Value
.equ	DDC7	= 7	; Port C Data Direction Register Value

; PINC - Port C Input Pins Address
.equ	PINC0	= 0	; Port C Input Pins
.equ	PINC1	= 1	; Port C Input Pins
.equ	PINC2	= 2	; Port C Input Pins
.equ	PINC3	= 3	; Port C Input Pins
.equ	PINC4	= 4	; Port C Input Pins
.equ	PINC5	= 5	; Port C Input Pins
.equ	PINC6	= 6	; Port C Input Pins
.equ	PINC7	= 7	; Port C Input Pins


; ***** PORTD ************************
; PORTD - Port D Data Register
.equ	PORTD0	= 0	; Port D Data Register Value
.equ	PD0	= 0	; For compatibility
.equ	PORTD1	= 1	; Port D Data Register Value
.equ	PD1	= 1	; For compatibility
.equ	PORTD2	= 2	; Port D Data Register Value
.equ	PD2	= 2	; For compatibility
.equ	PORTD3	= 3	; Port D Data Register Value
.equ	PD3	= 3	; For compatibility
.equ	PORTD4	= 4	; Port D Data Register Value
.equ	PD4	= 4	; For compatibility
.equ	PORTD5	= 5	; Port D Data Register Value
.equ	PD5	= 5	; For compatibility
.equ	PORTD6	= 6	; Port D Data Register Value
.equ	PD6	= 6	; For compatibility
.equ	PORTD7	= 7	; Port D Data Register Value
.equ	PD7	= 7	; For compatibility

; DDRD - Port D Data Direction Register
.equ	DDD0	= 0	; Port D Data Direction Register Value
.equ	DDD1	= 1	; Port D Data Direction Register Value
.equ	DDD2	= 2	; Port D Data Direction Register Value
.equ	DDD3	= 3	; Port D Data Direction Register Value
.equ	DDD4	= 4	; Port D Data Direction Register Value
.equ	DDD5	= 5	; Port D Data Direction Register Value
.equ	DDD6	= 6	; Port D Data Direction Register Value
.equ	DDD7	= 7	; Port D Data Direction Register Value

; PIND - Port D Input Pins Address
.equ	PIND0	= 0	; Port D Input Pins Value
.equ	PIND1	= 1	; Port D Input Pins Value
.equ	PIND2	= 2	; Port D Input Pins Value
.equ	PIND3	= 3	; Port D Input Pins Value
.equ	PIND4	= 4	; Port D Input Pins Value
.equ	PIND5	= 5	; Port D Input Pins Value
.equ	PIND6	= 6	; Port D Input Pins Value
.equ	PIND7	= 7	; Port D Input Pins Value


