trol73/avr-make/asm/include/m256RFR2def.inc
; ***** PORTE ************************
; PORTE - Port E Data Register
.equ	PORTE0	= 0	; Port E Data Register Value
.equ	PE0	= 0	; For compatibility
.equ	PORTE1	= 1	; Port E Data Register Value
.equ	PE1	= 1	; For compatibility
.equ	PORTE2	= 2	; Port E Data Register Value
.equ	PE2	= 2	; For compatibility
.equ	PORTE3	= 3	; Port E Data Register Value
.equ	PE3	= 3	; For compatibility
.equ	PORTE4	= 4	; Port E Data Register Value
.equ	PE4	= 4	; For compatibility
.equ	PORTE5	= 5	; Port E Data Register Value
.equ	PE5	= 5	; For compatibility
.equ	PORTE6	= 6	; Port E Data Register Value
.equ	PE6	= 6	; For compatibility
.equ	PORTE7	= 7	; Port E Data Register Value
.equ	PE7	= 7	; For compatibility

; DDRE - Port E Data Direction Register
.equ	DDE0	= 0	; Port E Data Direction Register Value
.equ	DDE1	= 1	; Port E Data Direction Register Value
.equ	DDE2	= 2	; Port E Data Direction Register Value
.equ	DDE3	= 3	; Port E Data Direction Register Value
.equ	DDE4	= 4	; Port E Data Direction Register Value
.equ	DDE5	= 5	; Port E Data Direction Register Value
.equ	DDE6	= 6	; Port E Data Direction Register Value
.equ	DDE7	= 7	; Port E Data Direction Register Value

; PINE - Port E Input Pins Address
.equ	PINE0	= 0	; Port E Input Pins Value
.equ	PINE1	= 1	; Port E Input Pins Value
.equ	PINE2	= 2	; Port E Input Pins Value
.equ	PINE3	= 3	; Port E Input Pins Value
.equ	PINE4	= 4	; Port E Input Pins Value
.equ	PINE5	= 5	; Port E Input Pins Value
.equ	PINE6	= 6	; Port E Input Pins Value
.equ	PINE7	= 7	; Port E Input Pins Value


; ***** PORTF ************************
; PORTF - Port F Data Register
.equ	PORTF0	= 0	; Port F Data Register Value
.equ	PF0	= 0	; For compatibility
.equ	PORTF1	= 1	; Port F Data Register Value
.equ	PF1	= 1	; For compatibility
.equ	PORTF2	= 2	; Port F Data Register Value
.equ	PF2	= 2	; For compatibility
.equ	PORTF3	= 3	; Port F Data Register Value
.equ	PF3	= 3	; For compatibility
.equ	PORTF4	= 4	; Port F Data Register Value
.equ	PF4	= 4	; For compatibility
.equ	PORTF5	= 5	; Port F Data Register Value
.equ	PF5	= 5	; For compatibility
.equ	PORTF6	= 6	; Port F Data Register Value
.equ	PF6	= 6	; For compatibility
.equ	PORTF7	= 7	; Port F Data Register Value
.equ	PF7	= 7	; For compatibility

; DDRF - Port F Data Direction Register
.equ	DDF0	= 0	; Port F Data Direction Register Value
.equ	DDF1	= 1	; Port F Data Direction Register Value
.equ	DDF2	= 2	; Port F Data Direction Register Value
.equ	DDF3	= 3	; Port F Data Direction Register Value
.equ	DDF4	= 4	; Port F Data Direction Register Value
.equ	DDF5	= 5	; Port F Data Direction Register Value
.equ	DDF6	= 6	; Port F Data Direction Register Value
.equ	DDF7	= 7	; Port F Data Direction Register Value

; PINF - Port F Input Pins Address
.equ	PINF0	= 0	; Port F Input Pins Value
.equ	PINF1	= 1	; Port F Input Pins Value
.equ	PINF2	= 2	; Port F Input Pins Value
.equ	PINF3	= 3	; Port F Input Pins Value
.equ	PINF4	= 4	; Port F Input Pins Value
.equ	PINF5	= 5	; Port F Input Pins Value
.equ	PINF6	= 6	; Port F Input Pins Value
.equ	PINF7	= 7	; Port F Input Pins Value


; ***** PORTG ************************
; PORTG - Port G Data Register
.equ	PORTG0	= 0	; Port G Data Register Value
.equ	PG0	= 0	; For compatibility
.equ	PORTG1	= 1	; Port G Data Register Value
.equ	PG1	= 1	; For compatibility
.equ	PORTG2	= 2	; Port G Data Register Value
.equ	PG2	= 2	; For compatibility
.equ	PORTG3	= 3	; Port G Data Register Value
.equ	PG3	= 3	; For compatibility
.equ	PORTG4	= 4	; Port G Data Register Value
.equ	PG4	= 4	; For compatibility
.equ	PORTG5	= 5	; Port G Data Register Value
.equ	PG5	= 5	; For compatibility
;.equ	Res0	= 6	; Reserved Bit
;.equ	Res1	= 7	; Reserved Bit

; DDRG - Port G Data Direction Register
.equ	DDG0	= 0	; Port G Data Direction Register Value
.equ	DDG1	= 1	; Port G Data Direction Register Value
.equ	DDG2	= 2	; Port G Data Direction Register Value
.equ	DDG3	= 3	; Port G Data Direction Register Value
.equ	DDG4	= 4	; Port G Data Direction Register Value
.equ	DDG5	= 5	; Port G Data Direction Register Value
;.equ	Res0	= 6	; Reserved Bit
;.equ	Res1	= 7	; Reserved Bit

; PING - Port G Input Pins Address
.equ	PING0	= 0	; Port G Input Pins Value
.equ	PING1	= 1	; Port G Input Pins Value
.equ	PING2	= 2	; Port G Input Pins Value
.equ	PING3	= 3	; Port G Input Pins Value
.equ	PING4	= 4	; Port G Input Pins Value
.equ	PING5	= 5	; Port G Input Pins Value
;.equ	Res0	= 6	; Reserved Bit
;.equ	Res1	= 7	; Reserved Bit


; ***** TIMER_COUNTER_0 **************
; TIMSK0 - Timer/Counter0 Interrupt Mask Register
.equ	TOIE0	= 0	; Timer/Counter0 Overflow Interrupt Enable
.equ	OCIE0A	= 1	; Timer/Counter0 Output Compare Match A Interrupt Enable
.equ	OCIE0B	= 2	; Timer/Counter0 Output Compare Match B Interrupt Enable
;.equ	Res0	= 3	; Reserved
;.equ	Res1	= 4	; Reserved
;.equ	Res2	= 5	; Reserved
;.equ	Res3	= 6	; Reserved
;.equ	Res4	= 7	; Reserved

; TIFR0 - Timer/Counter0 Interrupt Flag Register
.equ	TOV0	= 0	; Timer/Counter0 Overflow Flag
.equ	OCF0A	= 1	; Timer/Counter0 Output Compare A Match Flag
.equ	OCF0B	= 2	; Timer/Counter0 Output Compare B Match Flag
;.equ	Res0	= 3	; Reserved
;.equ	Res1	= 4	; Reserved
;.equ	Res2	= 5	; Reserved
;.equ	Res3	= 6	; Reserved
;.equ	Res4	= 7	; Reserved

; TCCR0A - Timer/Counter0 Control Register A
.equ	WGM00	= 0	; Waveform Generation Mode
.equ	WGM01	= 1	; Waveform Generation Mode
;.equ	Res0	= 2	; Reserved Bit
;.equ	Res1	= 3	; Reserved Bit
.equ	COM0B0	= 4	; Compare Match Output B Mode
.equ	COM0B1	= 5	; Compare Match Output B Mode
.equ	COM0A0	= 6	; Compare Match Output A Mode
.equ	COM0A1	= 7	; Compare Match Output A Mode

; TCCR0B - Timer/Counter0 Control Register B
.equ	CS00	= 0	; Clock Select
.equ	CS01	= 1	; Clock Select
.equ	CS02	= 2	; Clock Select
.equ	WGM02	= 3	; 
;.equ	Res0	= 4	; Reserved Bit
;.equ	Res1	= 5	; Reserved Bit
.equ	FOC0B	= 6	; Force Output Compare B
.equ	FOC0A	= 7	; Force Output Compare A

; TCNT0 - Timer/Counter0 Register
.equ	TCNT0_0	= 0	; Timer/Counter0 Byte
.equ	TCNT0_1	= 1	; Timer/Counter0 Byte
.equ	TCNT0_2	= 2	; Timer/Counter0 Byte
.equ	TCNT0_3	= 3	; Timer/Counter0 Byte
.equ	TCNT0_4	= 4	; Timer/Counter0 Byte
.equ	TCNT0_5	= 5	; Timer/Counter0 Byte
.equ	TCNT0_6	= 6	; Timer/Counter0 Byte
.equ	TCNT0_7	= 7	; Timer/Counter0 Byte

