trol73/avr-make/asm/include/m256RFR2def.inc
; OCR0A - Timer/Counter0 Output Compare Register
.equ	OCR0A_0	= 0	; Output Compare Register
.equ	OCR0A_1	= 1	; Output Compare Register
.equ	OCR0A_2	= 2	; Output Compare Register
.equ	OCR0A_3	= 3	; Output Compare Register
.equ	OCR0A_4	= 4	; Output Compare Register
.equ	OCR0A_5	= 5	; Output Compare Register
.equ	OCR0A_6	= 6	; Output Compare Register
.equ	OCR0A_7	= 7	; Output Compare Register

; OCR0B - Timer/Counter0 Output Compare Register B
.equ	OCR0B_0	= 0	; Output Compare Register
.equ	OCR0B_1	= 1	; Output Compare Register
.equ	OCR0B_2	= 2	; Output Compare Register
.equ	OCR0B_3	= 3	; Output Compare Register
.equ	OCR0B_4	= 4	; Output Compare Register
.equ	OCR0B_5	= 5	; Output Compare Register
.equ	OCR0B_6	= 6	; Output Compare Register
.equ	OCR0B_7	= 7	; Output Compare Register

; GTCCR - General Timer/Counter Control Register
.equ	PSRSYNC	= 0	; Prescaler Reset for Synchronous Timer/Counters
.equ	PSR10	= PSRSYNC	; For compatibility
.equ	PSRASY	= 1	; Prescaler Reset Timer/Counter2
;.equ	Res0	= 2	; Reserved
;.equ	Res1	= 3	; Reserved
;.equ	Res2	= 4	; Reserved
;.equ	Res3	= 5	; Reserved
;.equ	Res4	= 6	; Reserved
.equ	TSM	= 7	; Timer/Counter Synchronization Mode


; ***** TIMER_COUNTER_2 **************
; TIMSK2 - Timer/Counter Interrupt Mask register
.equ	TOIE2	= 0	; Timer/Counter2 Overflow Interrupt Enable
.equ	TOIE2A	= TOIE2	; For compatibility
.equ	OCIE2A	= 1	; Timer/Counter2 Output Compare Match A Interrupt Enable
.equ	OCIE2B	= 2	; Timer/Counter2 Output Compare Match B Interrupt Enable
;.equ	Res0	= 3	; Reserved Bit
;.equ	Res1	= 4	; Reserved Bit
;.equ	Res2	= 5	; Reserved Bit
;.equ	Res3	= 6	; Reserved Bit
;.equ	Res4	= 7	; Reserved Bit

; TIFR2 - Timer/Counter Interrupt Flag Register
.equ	TOV2	= 0	; Timer/Counter2 Overflow Flag
.equ	OCF2A	= 1	; Output Compare Flag 2 A
.equ	OCF2B	= 2	; Output Compare Flag 2 B
;.equ	Res0	= 3	; Reserved Bit
;.equ	Res1	= 4	; Reserved Bit
;.equ	Res2	= 5	; Reserved Bit
;.equ	Res3	= 6	; Reserved Bit
;.equ	Res4	= 7	; Reserved Bit

; TCCR2A - Timer/Counter2 Control Register A
.equ	WGM20	= 0	; Waveform Generation Mode
.equ	WGM21	= 1	; Waveform Generation Mode
;.equ	Res0	= 2	; Reserved
;.equ	Res1	= 3	; Reserved
.equ	COM2B0	= 4	; Compare Match Output B Mode
.equ	COM2B1	= 5	; Compare Match Output B Mode
.equ	COM2A0	= 6	; Compare Match Output A Mode
.equ	COM2A1	= 7	; Compare Match Output A Mode

; TCCR2B - Timer/Counter2 Control Register B
.equ	CS20	= 0	; Clock Select
.equ	CS21	= 1	; Clock Select
.equ	CS22	= 2	; Clock Select
.equ	WGM22	= 3	; Waveform Generation Mode
;.equ	Res0	= 4	; Reserved
;.equ	Res1	= 5	; Reserved
.equ	FOC2B	= 6	; Force Output Compare B
.equ	FOC2A	= 7	; Force Output Compare A

; TCNT2 - Timer/Counter2
.equ	TCNT20	= 0	; Timer/Counter2 Byte
.equ	TCNT21	= 1	; Timer/Counter2 Byte
.equ	TCNT22	= 2	; Timer/Counter2 Byte
.equ	TCNT23	= 3	; Timer/Counter2 Byte
.equ	TCNT24	= 4	; Timer/Counter2 Byte
.equ	TCNT25	= 5	; Timer/Counter2 Byte
.equ	TCNT26	= 6	; Timer/Counter2 Byte
.equ	TCNT27	= 7	; Timer/Counter2 Byte

; OCR2A - Timer/Counter2 Output Compare Register A
.equ	OCR2A0	= 0	; Output Compare Register
.equ	OCR2A1	= 1	; Output Compare Register
.equ	OCR2A2	= 2	; Output Compare Register
.equ	OCR2A3	= 3	; Output Compare Register
.equ	OCR2A4	= 4	; Output Compare Register
.equ	OCR2A5	= 5	; Output Compare Register
.equ	OCR2A6	= 6	; Output Compare Register
.equ	OCR2A7	= 7	; Output Compare Register

; OCR2B - Timer/Counter2 Output Compare Register B
.equ	OCR2B0	= 0	; Output Compare Register
.equ	OCR2B1	= 1	; Output Compare Register
.equ	OCR2B2	= 2	; Output Compare Register
.equ	OCR2B3	= 3	; Output Compare Register
.equ	OCR2B4	= 4	; Output Compare Register
.equ	OCR2B5	= 5	; Output Compare Register
.equ	OCR2B6	= 6	; Output Compare Register
.equ	OCR2B7	= 7	; Output Compare Register

; ASSR - Asynchronous Status Register
.equ	TCR2BUB	= 0	; Timer/Counter2 Control Register B Update Busy
.equ	TCR2AUB	= 1	; Timer/Counter2 Control Register A Update Busy
.equ	OCR2BUB	= 2	; Timer/Counter2 Output Compare Register B Update Busy
.equ	OCR2AUB	= 3	; Timer/Counter2 Output Compare Register A Update Busy
.equ	TCN2UB	= 4	; Timer/Counter2 Update Busy
.equ	AS2	= 5	; Timer/Counter2 Asynchronous Mode
.equ	EXCLK	= 6	; Enable External Clock Input
.equ	EXCLKAMR	= 7	; Enable External Clock Input for AMR

; GTCCR - General Timer Counter Control register
;.equ	PSRASY	= 1	; Prescaler Reset Timer/Counter2
.equ	PSR2	= PSRASY	; For compatibility
;.equ	TSM	= 7	; Timer/Counter Synchronization Mode


; ***** WATCHDOG *********************
; WDTCSR - Watchdog Timer Control Register
.equ	WDP0	= 0	; Watch Dog Timer Prescaler bit 0
.equ	WDP1	= 1	; Watch Dog Timer Prescaler bit 1
.equ	WDP2	= 2	; Watch Dog Timer Prescaler bit 2
.equ	WDE	= 3	; Watch Dog Enable
.equ	WDCE	= 4	; Watchdog Change Enable
.equ	WDP3	= 5	; Watchdog Timer Prescaler Bit 3
.equ	WDIE	= 6	; Watchdog Timeout Interrupt Enable
.equ	WDIF	= 7	; Watchdog Timeout Interrupt Flag


; ***** TIMER_COUNTER_5 **************
; TIMSK5 - Timer/Counter5 Interrupt Mask Register
.equ	TOIE5	= 0	; Timer/Counter5 Overflow Interrupt Enable
.equ	OCIE5A	= 1	; Timer/Counter5 Output Compare A Match Interrupt Enable
.equ	OCIE5B	= 2	; Timer/Counter5 Output Compare B Match Interrupt Enable
.equ	OCIE5C	= 3	; Timer/Counter5 Output Compare C Match Interrupt Enable
;.equ	Res	= 4	; Reserved Bit
.equ	ICIE5	= 5	; Timer/Counter5 Input Capture Interrupt Enable
;.equ	Res0	= 6	; Reserved Bit
;.equ	Res1	= 7	; Reserved Bit

; TIFR5 - Timer/Counter5 Interrupt Flag Register
.equ	TOV5	= 0	; Timer/Counter5 Overflow Flag
.equ	OCF5A	= 1	; Timer/Counter5 Output Compare A Match Flag
.equ	OCF5B	= 2	; Timer/Counter5 Output Compare B Match Flag
.equ	OCF5C	= 3	; Timer/Counter5 Output Compare C Match Flag
;.equ	Res	= 4	; Reserved Bit
.equ	ICF5	= 5	; Timer/Counter5 Input Capture Flag
;.equ	Res0	= 6	; Reserved Bit
;.equ	Res1	= 7	; Reserved Bit

; TCCR5A - Timer/Counter5 Control Register A
.equ	WGM50	= 0	; Waveform Generation Mode
.equ	WGM51	= 1	; Waveform Generation Mode
.equ	COM5C0	= 2	; Compare Output Mode for Channel C
.equ	COM5C1	= 3	; Compare Output Mode for Channel C
.equ	COM5B0	= 4	; Compare Output Mode for Channel B
.equ	COM5B1	= 5	; Compare Output Mode for Channel B
.equ	COM5A0	= 6	; Compare Output Mode for Channel A
.equ	COM5A1	= 7	; Compare Output Mode for Channel A

; TCCR5B - Timer/Counter5 Control Register B
.equ	CS50	= 0	; Clock Select
.equ	CS51	= 1	; Clock Select
.equ	CS52	= 2	; Clock Select
.equ	WGM52	= 3	; Waveform Generation Mode
.equ	WGM53	= 4	; Waveform Generation Mode
;.equ	Res	= 5	; Reserved Bit
.equ	ICES5	= 6	; Input Capture 5 Edge Select
.equ	ICNC5	= 7	; Input Capture 5 Noise Canceller

; TCCR5C - Timer/Counter5 Control Register C
;.equ	Res0	= 0	; Reserved
;.equ	Res1	= 1	; Reserved
;.equ	Res2	= 2	; Reserved
;.equ	Res3	= 3	; Reserved
;.equ	Res4	= 4	; Reserved
.equ	FOC5C	= 5	; Force Output Compare for Channel C
.equ	FOC5B	= 6	; Force Output Compare for Channel B
.equ	FOC5A	= 7	; Force Output Compare for Channel A

; ICR5H - Timer/Counter5 Input Capture Register High Byte
.equ	ICR5H0	= 0	; Timer/Counter5 Input Capture Register High Byte
.equ	ICR5H1	= 1	; Timer/Counter5 Input Capture Register High Byte
.equ	ICR5H2	= 2	; Timer/Counter5 Input Capture Register High Byte
.equ	ICR5H3	= 3	; Timer/Counter5 Input Capture Register High Byte
.equ	ICR5H4	= 4	; Timer/Counter5 Input Capture Register High Byte
.equ	ICR5H5	= 5	; Timer/Counter5 Input Capture Register High Byte
.equ	ICR5H6	= 6	; Timer/Counter5 Input Capture Register High Byte
.equ	ICR5H7	= 7	; Timer/Counter5 Input Capture Register High Byte

