trol73/avr-make/asm/include/m256RFR2def.inc
; ICR5L - Timer/Counter5 Input Capture Register Low Byte
.equ	ICR5L0	= 0	; Timer/Counter5 Input Capture Register Low Byte
.equ	ICR5L1	= 1	; Timer/Counter5 Input Capture Register Low Byte
.equ	ICR5L2	= 2	; Timer/Counter5 Input Capture Register Low Byte
.equ	ICR5L3	= 3	; Timer/Counter5 Input Capture Register Low Byte
.equ	ICR5L4	= 4	; Timer/Counter5 Input Capture Register Low Byte
.equ	ICR5L5	= 5	; Timer/Counter5 Input Capture Register Low Byte
.equ	ICR5L6	= 6	; Timer/Counter5 Input Capture Register Low Byte
.equ	ICR5L7	= 7	; Timer/Counter5 Input Capture Register Low Byte


; ***** TIMER_COUNTER_4 **************
; TIMSK4 - Timer/Counter4 Interrupt Mask Register
.equ	TOIE4	= 0	; Timer/Counter4 Overflow Interrupt Enable
.equ	OCIE4A	= 1	; Timer/Counter4 Output Compare A Match Interrupt Enable
.equ	OCIE4B	= 2	; Timer/Counter4 Output Compare B Match Interrupt Enable
.equ	OCIE4C	= 3	; Timer/Counter4 Output Compare C Match Interrupt Enable
;.equ	Res	= 4	; Reserved Bit
.equ	ICIE4	= 5	; Timer/Counter4 Input Capture Interrupt Enable
;.equ	Res0	= 6	; Reserved Bit
;.equ	Res1	= 7	; Reserved Bit

; TIFR4 - Timer/Counter4 Interrupt Flag Register
.equ	TOV4	= 0	; Timer/Counter4 Overflow Flag
.equ	OCF4A	= 1	; Timer/Counter4 Output Compare A Match Flag
.equ	OCF4B	= 2	; Timer/Counter4 Output Compare B Match Flag
.equ	OCF4C	= 3	; Timer/Counter4 Output Compare C Match Flag
;.equ	Res	= 4	; Reserved Bit
.equ	ICF4	= 5	; Timer/Counter4 Input Capture Flag
;.equ	Res0	= 6	; Reserved Bit
;.equ	Res1	= 7	; Reserved Bit

; TCCR4A - Timer/Counter4 Control Register A
.equ	WGM40	= 0	; Waveform Generation Mode
.equ	WGM41	= 1	; Waveform Generation Mode
.equ	COM4C0	= 2	; Compare Output Mode for Channel C
.equ	COM4C1	= 3	; Compare Output Mode for Channel C
.equ	COM4B0	= 4	; Compare Output Mode for Channel B
.equ	COM4B1	= 5	; Compare Output Mode for Channel B
.equ	COM4A0	= 6	; Compare Output Mode for Channel A
.equ	COM4A1	= 7	; Compare Output Mode for Channel A

; TCCR4B - Timer/Counter4 Control Register B
.equ	CS40	= 0	; Clock Select
.equ	CS41	= 1	; Clock Select
.equ	CS42	= 2	; Clock Select
.equ	WGM42	= 3	; Waveform Generation Mode
.equ	WGM43	= 4	; Waveform Generation Mode
;.equ	Res	= 5	; Reserved Bit
.equ	ICES4	= 6	; Input Capture 4 Edge Select
.equ	ICNC4	= 7	; Input Capture 4 Noise Canceller

; TCCR4C - Timer/Counter4 Control Register C
;.equ	Res0	= 0	; Reserved
;.equ	Res1	= 1	; Reserved
;.equ	Res2	= 2	; Reserved
;.equ	Res3	= 3	; Reserved
;.equ	Res4	= 4	; Reserved
.equ	FOC4C	= 5	; Force Output Compare for Channel C
.equ	FOC4B	= 6	; Force Output Compare for Channel B
.equ	FOC4A	= 7	; Force Output Compare for Channel A


; ***** TIMER_COUNTER_3 **************
; TIMSK3 - Timer/Counter3 Interrupt Mask Register
.equ	TOIE3	= 0	; Timer/Counter3 Overflow Interrupt Enable
.equ	OCIE3A	= 1	; Timer/Counter3 Output Compare A Match Interrupt Enable
.equ	OCIE3B	= 2	; Timer/Counter3 Output Compare B Match Interrupt Enable
.equ	OCIE3C	= 3	; Timer/Counter3 Output Compare C Match Interrupt Enable
;.equ	Res	= 4	; Reserved Bit
.equ	ICIE3	= 5	; Timer/Counter3 Input Capture Interrupt Enable
;.equ	Res0	= 6	; Reserved Bit
;.equ	Res1	= 7	; Reserved Bit

; TIFR3 - Timer/Counter3 Interrupt Flag Register
.equ	TOV3	= 0	; Timer/Counter3 Overflow Flag
.equ	OCF3A	= 1	; Timer/Counter3 Output Compare A Match Flag
.equ	OCF3B	= 2	; Timer/Counter3 Output Compare B Match Flag
.equ	OCF3C	= 3	; Timer/Counter3 Output Compare C Match Flag
;.equ	Res	= 4	; Reserved Bit
.equ	ICF3	= 5	; Timer/Counter3 Input Capture Flag
;.equ	Res0	= 6	; Reserved Bit
;.equ	Res1	= 7	; Reserved Bit

; TCCR3A - Timer/Counter3 Control Register A
.equ	WGM30	= 0	; Waveform Generation Mode
.equ	WGM31	= 1	; Waveform Generation Mode
.equ	COM3C0	= 2	; Compare Output Mode for Channel C
.equ	COM3C1	= 3	; Compare Output Mode for Channel C
.equ	COM3B0	= 4	; Compare Output Mode for Channel B
.equ	COM3B1	= 5	; Compare Output Mode for Channel B
.equ	COM3A0	= 6	; Compare Output Mode for Channel A
.equ	COM3A1	= 7	; Compare Output Mode for Channel A

; TCCR3B - Timer/Counter3 Control Register B
.equ	CS30	= 0	; Clock Select
.equ	CS31	= 1	; Clock Select
.equ	CS32	= 2	; Clock Select
.equ	WGM32	= 3	; Waveform Generation Mode
.equ	WGM33	= 4	; Waveform Generation Mode
;.equ	Res	= 5	; Reserved Bit
.equ	ICES3	= 6	; Input Capture 3 Edge Select
.equ	ICNC3	= 7	; Input Capture 3 Noise Canceller

; TCCR3C - Timer/Counter3 Control Register C
;.equ	Res0	= 0	; Reserved
;.equ	Res1	= 1	; Reserved
;.equ	Res2	= 2	; Reserved
;.equ	Res3	= 3	; Reserved
;.equ	Res4	= 4	; Reserved
.equ	FOC3C	= 5	; Force Output Compare for Channel C
.equ	FOC3B	= 6	; Force Output Compare for Channel B
.equ	FOC3A	= 7	; Force Output Compare for Channel A


; ***** TIMER_COUNTER_1 **************
; TIMSK1 - Timer/Counter1 Interrupt Mask Register
.equ	TOIE1	= 0	; Timer/Counter1 Overflow Interrupt Enable
.equ	OCIE1A	= 1	; Timer/Counter1 Output Compare A Match Interrupt Enable
.equ	OCIE1B	= 2	; Timer/Counter1 Output Compare B Match Interrupt Enable
.equ	OCIE1C	= 3	; Timer/Counter1 Output Compare C Match Interrupt Enable
;.equ	Res	= 4	; Reserved Bit
.equ	ICIE1	= 5	; Timer/Counter1 Input Capture Interrupt Enable
;.equ	Res0	= 6	; Reserved Bit
;.equ	Res1	= 7	; Reserved Bit

; TIFR1 - Timer/Counter1 Interrupt Flag Register
.equ	TOV1	= 0	; Timer/Counter1 Overflow Flag
.equ	OCF1A	= 1	; Timer/Counter1 Output Compare A Match Flag
.equ	OCF1B	= 2	; Timer/Counter1 Output Compare B Match Flag
.equ	OCF1C	= 3	; Timer/Counter1 Output Compare C Match Flag
;.equ	Res	= 4	; Reserved Bit
.equ	ICF1	= 5	; Timer/Counter1 Input Capture Flag
;.equ	Res0	= 6	; Reserved Bit
;.equ	Res1	= 7	; Reserved Bit

; TCCR1A - Timer/Counter1 Control Register A
.equ	WGM10	= 0	; Waveform Generation Mode
.equ	WGM11	= 1	; Waveform Generation Mode
.equ	COM1C0	= 2	; Compare Output Mode for Channel C
.equ	COM1C1	= 3	; Compare Output Mode for Channel C
.equ	COM1B0	= 4	; Compare Output Mode for Channel B
.equ	COM1B1	= 5	; Compare Output Mode for Channel B
.equ	COM1A0	= 6	; Compare Output Mode for Channel A
.equ	COM1A1	= 7	; Compare Output Mode for Channel A

; TCCR1B - Timer/Counter1 Control Register B
.equ	CS10	= 0	; Clock Select
.equ	CS11	= 1	; Clock Select
.equ	CS12	= 2	; Clock Select
.equ	WGM12	= 3	; Waveform Generation Mode
.equ	WGM13	= 4	; Waveform Generation Mode
;.equ	Res	= 5	; Reserved Bit
.equ	ICES1	= 6	; Input Capture 1 Edge Select
.equ	ICNC1	= 7	; Input Capture 1 Noise Canceller

