trol73/avr-make/asm/include/m256RFR2def.inc
; TCCR1C - Timer/Counter1 Control Register C
;.equ	Res0	= 0	; Reserved
;.equ	Res1	= 1	; Reserved
;.equ	Res2	= 2	; Reserved
;.equ	Res3	= 3	; Reserved
;.equ	Res4	= 4	; Reserved
.equ	FOC1C	= 5	; Force Output Compare for Channel C
.equ	FOC1B	= 6	; Force Output Compare for Channel B
.equ	FOC1A	= 7	; Force Output Compare for Channel A


; ***** TRX24 ************************
; IRQ_MASK1 - Transceiver Interrupt Enable Register 1
.equ	TX_START_EN	= 0	; Transmit Start Interrupt enable
.equ	AMI0	= 1	; Address Match Interrupt enable Address filter 0
.equ	AMI1	= 2	; Address Match Interrupt enable Address filter 1
.equ	AMI2	= 3	; Address Match Interrupt enable Address filter 2
.equ	AMI3	= 4	; Address Match Interrupt enable Address filter 3
;.equ	Res0	= 5	; Reserved Bit
;.equ	Res1	= 6	; Reserved Bit
;.equ	Res2	= 7	; Reserved Bit

; IRQ_STATUS1 - Transceiver Interrupt Status Register 1
.equ	TX_START	= 0	; Transmit Start Interrupt Status
;.equ	AMI0	= 1	; Address Match Interrupt Status Address filter 0
;.equ	AMI1	= 2	; Address Match Interrupt Status Address filter 1
;.equ	AMI2	= 3	; Address Match Interrupt Status Address filter 2
;.equ	AMI3	= 4	; Address Match Interrupt Status Address filter 3
;.equ	Res0	= 5	; Reserved Bit
;.equ	Res1	= 6	; Reserved Bit
;.equ	Res2	= 7	; Reserved Bit

; MAFSA0L - Transceiver MAC Short Address Register for Frame Filter 0 (Low Byte)
.equ	MAFSA0L0	= 0	; MAC Short Address low Byte for Frame Filter 0
.equ	MAFSA0L1	= 1	; MAC Short Address low Byte for Frame Filter 0
.equ	MAFSA0L2	= 2	; MAC Short Address low Byte for Frame Filter 0
.equ	MAFSA0L3	= 3	; MAC Short Address low Byte for Frame Filter 0
.equ	MAFSA0L4	= 4	; MAC Short Address low Byte for Frame Filter 0
.equ	MAFSA0L5	= 5	; MAC Short Address low Byte for Frame Filter 0
.equ	MAFSA0L6	= 6	; MAC Short Address low Byte for Frame Filter 0
.equ	MAFSA0L7	= 7	; MAC Short Address low Byte for Frame Filter 0

; MAFSA0H - Transceiver MAC Short Address Register for Frame Filter 0 (High Byte)
.equ	MAFSA0H0	= 0	; MAC Short Address high Byte for Frame Filter 0
.equ	MAFSA0H1	= 1	; MAC Short Address high Byte for Frame Filter 0
.equ	MAFSA0H2	= 2	; MAC Short Address high Byte for Frame Filter 0
.equ	MAFSA0H3	= 3	; MAC Short Address high Byte for Frame Filter 0
.equ	MAFSA0H4	= 4	; MAC Short Address high Byte for Frame Filter 0
.equ	MAFSA0H5	= 5	; MAC Short Address high Byte for Frame Filter 0
.equ	MAFSA0H6	= 6	; MAC Short Address high Byte for Frame Filter 0
.equ	MAFSA0H7	= 7	; MAC Short Address high Byte for Frame Filter 0

; MAFPA0L - Transceiver Personal Area Network ID Register for Frame Filter 0 (Low Byte)
.equ	MAFPA0L0	= 0	; MAC Personal Area Network ID low Byte for Frame Filter 0
.equ	MAFPA0L1	= 1	; MAC Personal Area Network ID low Byte for Frame Filter 0
.equ	MAFPA0L2	= 2	; MAC Personal Area Network ID low Byte for Frame Filter 0
.equ	MAFPA0L3	= 3	; MAC Personal Area Network ID low Byte for Frame Filter 0
.equ	MAFPA0L4	= 4	; MAC Personal Area Network ID low Byte for Frame Filter 0
.equ	MAFPA0L5	= 5	; MAC Personal Area Network ID low Byte for Frame Filter 0
.equ	MAFPA0L6	= 6	; MAC Personal Area Network ID low Byte for Frame Filter 0
.equ	MAFPA0L7	= 7	; MAC Personal Area Network ID low Byte for Frame Filter 0

; MAFPA0H - Transceiver Personal Area Network ID Register for Frame Filter 0 (High Byte)
.equ	MAFPA0H0	= 0	; MAC Personal Area Network ID high Byte for Frame Filter 0
.equ	MAFPA0H1	= 1	; MAC Personal Area Network ID high Byte for Frame Filter 0
.equ	MAFPA0H2	= 2	; MAC Personal Area Network ID high Byte for Frame Filter 0
.equ	MAFPA0H3	= 3	; MAC Personal Area Network ID high Byte for Frame Filter 0
.equ	MAFPA0H4	= 4	; MAC Personal Area Network ID high Byte for Frame Filter 0
.equ	MAFPA0H5	= 5	; MAC Personal Area Network ID high Byte for Frame Filter 0
.equ	MAFPA0H6	= 6	; MAC Personal Area Network ID high Byte for Frame Filter 0
.equ	MAFPA0H7	= 7	; MAC Personal Area Network ID high Byte for Frame Filter 0

; MAFSA1L - Transceiver MAC Short Address Register for Frame Filter 1 (Low Byte)
.equ	MAFSA1L0	= 0	; MAC Short Address low Byte for Frame Filter 1
.equ	MAFSA1L1	= 1	; MAC Short Address low Byte for Frame Filter 1
.equ	MAFSA1L2	= 2	; MAC Short Address low Byte for Frame Filter 1
.equ	MAFSA1L3	= 3	; MAC Short Address low Byte for Frame Filter 1
.equ	MAFSA1L4	= 4	; MAC Short Address low Byte for Frame Filter 1
.equ	MAFSA1L5	= 5	; MAC Short Address low Byte for Frame Filter 1
.equ	MAFSA1L6	= 6	; MAC Short Address low Byte for Frame Filter 1
.equ	MAFSA1L7	= 7	; MAC Short Address low Byte for Frame Filter 1

; MAFSA1H - Transceiver MAC Short Address Register for Frame Filter 1 (High Byte)
.equ	MAFSA1H0	= 0	; MAC Short Address high Byte for Frame Filter 1
.equ	MAFSA1H1	= 1	; MAC Short Address high Byte for Frame Filter 1
.equ	MAFSA1H2	= 2	; MAC Short Address high Byte for Frame Filter 1
.equ	MAFSA1H3	= 3	; MAC Short Address high Byte for Frame Filter 1
.equ	MAFSA1H4	= 4	; MAC Short Address high Byte for Frame Filter 1
.equ	MAFSA1H5	= 5	; MAC Short Address high Byte for Frame Filter 1
.equ	MAFSA1H6	= 6	; MAC Short Address high Byte for Frame Filter 1
.equ	MAFSA1H7	= 7	; MAC Short Address high Byte for Frame Filter 1

; MAFPA1L - Transceiver Personal Area Network ID Register for Frame Filter 1 (Low Byte)
.equ	MAFPA1L0	= 0	; MAC Personal Area Network ID low Byte for Frame Filter 1
.equ	MAFPA1L1	= 1	; MAC Personal Area Network ID low Byte for Frame Filter 1
.equ	MAFPA1L2	= 2	; MAC Personal Area Network ID low Byte for Frame Filter 1
.equ	MAFPA1L3	= 3	; MAC Personal Area Network ID low Byte for Frame Filter 1
.equ	MAFPA1L4	= 4	; MAC Personal Area Network ID low Byte for Frame Filter 1
.equ	MAFPA1L5	= 5	; MAC Personal Area Network ID low Byte for Frame Filter 1
.equ	MAFPA1L6	= 6	; MAC Personal Area Network ID low Byte for Frame Filter 1
.equ	MAFPA1L7	= 7	; MAC Personal Area Network ID low Byte for Frame Filter 1

; MAFPA1H - Transceiver Personal Area Network ID Register for Frame Filter 1 (High Byte)
.equ	MAFPA1H0	= 0	; MAC Personal Area Network ID high Byte for Frame Filter 1
.equ	MAFPA1H1	= 1	; MAC Personal Area Network ID high Byte for Frame Filter 1
.equ	MAFPA1H2	= 2	; MAC Personal Area Network ID high Byte for Frame Filter 1
.equ	MAFPA1H3	= 3	; MAC Personal Area Network ID high Byte for Frame Filter 1
.equ	MAFPA1H4	= 4	; MAC Personal Area Network ID high Byte for Frame Filter 1
.equ	MAFPA1H5	= 5	; MAC Personal Area Network ID high Byte for Frame Filter 1
.equ	MAFPA1H6	= 6	; MAC Personal Area Network ID high Byte for Frame Filter 1
.equ	MAFPA1H7	= 7	; MAC Personal Area Network ID high Byte for Frame Filter 1

