trol73/avr-make/asm/include/m256RFR2def.inc
; MAFSA2L - Transceiver MAC Short Address Register for Frame Filter 2 (Low Byte)
.equ	MAFSA2L0	= 0	; MAC Short Address low Byte for Frame Filter 2
.equ	MAFSA2L1	= 1	; MAC Short Address low Byte for Frame Filter 2
.equ	MAFSA2L2	= 2	; MAC Short Address low Byte for Frame Filter 2
.equ	MAFSA2L3	= 3	; MAC Short Address low Byte for Frame Filter 2
.equ	MAFSA2L4	= 4	; MAC Short Address low Byte for Frame Filter 2
.equ	MAFSA2L5	= 5	; MAC Short Address low Byte for Frame Filter 2
.equ	MAFSA2L6	= 6	; MAC Short Address low Byte for Frame Filter 2
.equ	MAFSA2L7	= 7	; MAC Short Address low Byte for Frame Filter 2

; MAFSA2H - Transceiver MAC Short Address Register for Frame Filter 2 (High Byte)
.equ	MAFSA2H0	= 0	; MAC Short Address high Byte for Frame Filter 2
.equ	MAFSA2H1	= 1	; MAC Short Address high Byte for Frame Filter 2
.equ	MAFSA2H2	= 2	; MAC Short Address high Byte for Frame Filter 2
.equ	MAFSA2H3	= 3	; MAC Short Address high Byte for Frame Filter 2
.equ	MAFSA2H4	= 4	; MAC Short Address high Byte for Frame Filter 2
.equ	MAFSA2H5	= 5	; MAC Short Address high Byte for Frame Filter 2
.equ	MAFSA2H6	= 6	; MAC Short Address high Byte for Frame Filter 2
.equ	MAFSA2H7	= 7	; MAC Short Address high Byte for Frame Filter 2

; MAFPA2L - Transceiver Personal Area Network ID Register for Frame Filter 2 (Low Byte)
.equ	MAFPA2L0	= 0	; MAC Personal Area Network ID low Byte for Frame Filter 2
.equ	MAFPA2L1	= 1	; MAC Personal Area Network ID low Byte for Frame Filter 2
.equ	MAFPA2L2	= 2	; MAC Personal Area Network ID low Byte for Frame Filter 2
.equ	MAFPA2L3	= 3	; MAC Personal Area Network ID low Byte for Frame Filter 2
.equ	MAFPA2L4	= 4	; MAC Personal Area Network ID low Byte for Frame Filter 2
.equ	MAFPA2L5	= 5	; MAC Personal Area Network ID low Byte for Frame Filter 2
.equ	MAFPA2L6	= 6	; MAC Personal Area Network ID low Byte for Frame Filter 2
.equ	MAFPA2L7	= 7	; MAC Personal Area Network ID low Byte for Frame Filter 2

; MAFPA2H - Transceiver Personal Area Network ID Register for Frame Filter 2 (High Byte)
.equ	MAFPA2H0	= 0	; MAC Personal Area Network ID high Byte for Frame Filter 2
.equ	MAFPA2H1	= 1	; MAC Personal Area Network ID high Byte for Frame Filter 2
.equ	MAFPA2H2	= 2	; MAC Personal Area Network ID high Byte for Frame Filter 2
.equ	MAFPA2H3	= 3	; MAC Personal Area Network ID high Byte for Frame Filter 2
.equ	MAFPA2H4	= 4	; MAC Personal Area Network ID high Byte for Frame Filter 2
.equ	MAFPA2H5	= 5	; MAC Personal Area Network ID high Byte for Frame Filter 2
.equ	MAFPA2H6	= 6	; MAC Personal Area Network ID high Byte for Frame Filter 2
.equ	MAFPA2H7	= 7	; MAC Personal Area Network ID high Byte for Frame Filter 2

; MAFSA3L - Transceiver MAC Short Address Register for Frame Filter 3 (Low Byte)
.equ	MAFSA3L0	= 0	; MAC Short Address low Byte for Frame Filter 3
.equ	MAFSA3L1	= 1	; MAC Short Address low Byte for Frame Filter 3
.equ	MAFSA3L2	= 2	; MAC Short Address low Byte for Frame Filter 3
.equ	MAFSA3L3	= 3	; MAC Short Address low Byte for Frame Filter 3
.equ	MAFSA3L4	= 4	; MAC Short Address low Byte for Frame Filter 3
.equ	MAFSA3L5	= 5	; MAC Short Address low Byte for Frame Filter 3
.equ	MAFSA3L6	= 6	; MAC Short Address low Byte for Frame Filter 3
.equ	MAFSA3L7	= 7	; MAC Short Address low Byte for Frame Filter 3

; MAFSA3H - Transceiver MAC Short Address Register for Frame Filter 3 (High Byte)
.equ	MAFSA3H0	= 0	; MAC Short Address high Byte for Frame Filter 3
.equ	MAFSA3H1	= 1	; MAC Short Address high Byte for Frame Filter 3
.equ	MAFSA3H2	= 2	; MAC Short Address high Byte for Frame Filter 3
.equ	MAFSA3H3	= 3	; MAC Short Address high Byte for Frame Filter 3
.equ	MAFSA3H4	= 4	; MAC Short Address high Byte for Frame Filter 3
.equ	MAFSA3H5	= 5	; MAC Short Address high Byte for Frame Filter 3
.equ	MAFSA3H6	= 6	; MAC Short Address high Byte for Frame Filter 3
.equ	MAFSA3H7	= 7	; MAC Short Address high Byte for Frame Filter 3

; MAFPA3L - Transceiver Personal Area Network ID Register for Frame Filter 3 (Low Byte)
.equ	MAFPA3L0	= 0	; MAC Personal Area Network ID low Byte for Frame Filter 3
.equ	MAFPA3L1	= 1	; MAC Personal Area Network ID low Byte for Frame Filter 3
.equ	MAFPA3L2	= 2	; MAC Personal Area Network ID low Byte for Frame Filter 3
.equ	MAFPA3L3	= 3	; MAC Personal Area Network ID low Byte for Frame Filter 3
.equ	MAFPA3L4	= 4	; MAC Personal Area Network ID low Byte for Frame Filter 3
.equ	MAFPA3L5	= 5	; MAC Personal Area Network ID low Byte for Frame Filter 3
.equ	MAFPA3L6	= 6	; MAC Personal Area Network ID low Byte for Frame Filter 3
.equ	MAFPA3L7	= 7	; MAC Personal Area Network ID low Byte for Frame Filter 3

; MAFPA3H - Transceiver Personal Area Network ID Register for Frame Filter 3 (High Byte)
.equ	MAFPA3H0	= 0	; MAC Personal Area Network ID high Byte for Frame Filter 3
.equ	MAFPA3H1	= 1	; MAC Personal Area Network ID high Byte for Frame Filter 3
.equ	MAFPA3H2	= 2	; MAC Personal Area Network ID high Byte for Frame Filter 3
.equ	MAFPA3H3	= 3	; MAC Personal Area Network ID high Byte for Frame Filter 3
.equ	MAFPA3H4	= 4	; MAC Personal Area Network ID high Byte for Frame Filter 3
.equ	MAFPA3H5	= 5	; MAC Personal Area Network ID high Byte for Frame Filter 3
.equ	MAFPA3H6	= 6	; MAC Personal Area Network ID high Byte for Frame Filter 3
.equ	MAFPA3H7	= 7	; MAC Personal Area Network ID high Byte for Frame Filter 3

; MAFCR1 - Multiple Address Filter Configuration Register 1
.equ	AACK_0_I_AM_COORD	= 0	; Enable PAN Coordinator mode for address filter 0.
.equ	AACK_0_SET_PD	= 1	; Set Data Pending bit for address filter 0.
.equ	AACK_1_I_AM_COORD	= 2	; Enable PAN Coordinator mode for address filter 1.
.equ	AACK_1_SET_PD	= 3	; Set Data Pending bit for address filter 1.
.equ	AACK_2_I_AM_COORD	= 4	; Enable PAN Coordinator mode for address filter 2.
.equ	AACK_2_SET_PD	= 5	; Set Data Pending bit for address filter 2.
.equ	AACK_3_I_AM_COORD	= 6	; Enable PAN Coordinator mode for address filter 3.
.equ	AACK_3_SET_PD	= 7	; Set Data Pending bit for address filter 3.

; MAFCR0 - Multiple Address Filter Configuration Register 0
.equ	MAF0EN	= 0	; Multiple Address Filter 0 Enable
.equ	MAF1EN	= 1	; Multiple Address Filter 1 Enable
.equ	MAF2EN	= 2	; Multiple Address Filter 2 Enable
.equ	MAF3EN	= 3	; Multiple Address Filter 3 Enable
;.equ	Res0	= 4	; Reserved Bit
;.equ	Res1	= 5	; Reserved Bit
;.equ	Res2	= 6	; Reserved Bit
;.equ	Res3	= 7	; Reserved Bit

