trol73/avr-make/asm/include/m256RFR2def.inc
; PARCR - Power Amplifier Ramp up/down Control Register
.equ	PARUFI	= 0	; Power Amplifier Ramp Up Frequency Inversion
.equ	PARDFI	= 1	; Power Amplifier Ramp Down Frequency Inversion
.equ	PALTU0	= 2	; ext. PA Ramp Up Lead Time
.equ	PALTU1	= 3	; ext. PA Ramp Up Lead Time
.equ	PALTU2	= 4	; ext. PA Ramp Up Lead Time
.equ	PALTD0	= 5	; ext. PA Ramp Down Lead Time
.equ	PALTD1	= 6	; ext. PA Ramp Down Lead Time
.equ	PALTD2	= 7	; ext. PA Ramp Down Lead Time

; AES_CTRL - AES Control Register
;.equ	Res0	= 0	; Reserved Bit
;.equ	Res1	= 1	; Reserved Bit
.equ	AES_IM	= 2	; AES Interrupt Enable
.equ	AES_DIR	= 3	; Set AES Operation Direction
;.equ	Res	= 4	; Reserved Bit
.equ	AES_MODE	= 5	; Set AES Operation Mode
;.equ	Res	= 6	; Reserved Bit
.equ	AES_REQUEST	= 7	; Request AES Operation.

; AES_STATUS - AES Status Register
.equ	AES_DONE	= 0	; AES Operation Finished with Success
;.equ	Res0	= 1	; Reserved
;.equ	Res1	= 2	; Reserved
;.equ	Res2	= 3	; Reserved
;.equ	Res3	= 4	; Reserved
;.equ	Res4	= 5	; Reserved
.equ	Res5	= 6	; Reserved
.equ	AES_ER	= 7	; AES Operation Finished with Error

; AES_STATE - AES Plain and Cipher Text Buffer Register
.equ	AES_STATE0	= 0	; AES Plain and Cipher Text Buffer
.equ	AES_STATE1	= 1	; AES Plain and Cipher Text Buffer
.equ	AES_STATE2	= 2	; AES Plain and Cipher Text Buffer
.equ	AES_STATE3	= 3	; AES Plain and Cipher Text Buffer
.equ	AES_STATE4	= 4	; AES Plain and Cipher Text Buffer
.equ	AES_STATE5	= 5	; AES Plain and Cipher Text Buffer
.equ	AES_STATE6	= 6	; AES Plain and Cipher Text Buffer
.equ	AES_STATE7	= 7	; AES Plain and Cipher Text Buffer

; AES_KEY - AES Encryption and Decryption Key Buffer Register
.equ	AES_KEY0	= 0	; AES Encryption/Decryption Key Buffer
.equ	AES_KEY1	= 1	; AES Encryption/Decryption Key Buffer
.equ	AES_KEY2	= 2	; AES Encryption/Decryption Key Buffer
.equ	AES_KEY3	= 3	; AES Encryption/Decryption Key Buffer
.equ	AES_KEY4	= 4	; AES Encryption/Decryption Key Buffer
.equ	AES_KEY5	= 5	; AES Encryption/Decryption Key Buffer
.equ	AES_KEY6	= 6	; AES Encryption/Decryption Key Buffer
.equ	AES_KEY7	= 7	; AES Encryption/Decryption Key Buffer

; TRX_STATUS - Transceiver Status Register
.equ	TRX_STATUS0	= 0	; Transceiver Main Status
.equ	TRX_STATUS1	= 1	; Transceiver Main Status
.equ	TRX_STATUS2	= 2	; Transceiver Main Status
.equ	TRX_STATUS3	= 3	; Transceiver Main Status
.equ	TRX_STATUS4	= 4	; Transceiver Main Status
.equ	TST_STATUS	= 5	; Test mode status
.equ	CCA_STATUS	= 6	; CCA Status Result
.equ	CCA_DONE	= 7	; CCA Algorithm Status

; TRX_STATE - Transceiver State Control Register
.equ	TRX_CMD0	= 0	; State Control Command
.equ	TRX_CMD1	= 1	; State Control Command
.equ	TRX_CMD2	= 2	; State Control Command
.equ	TRX_CMD3	= 3	; State Control Command
.equ	TRX_CMD4	= 4	; State Control Command
.equ	TRAC_STATUS0	= 5	; Transaction Status
.equ	TRAC_STATUS1	= 6	; Transaction Status
.equ	TRAC_STATUS2	= 7	; Transaction Status

; TRX_CTRL_0 - Reserved
;.equ	Res0	= 0	; Reserved
;.equ	Res1	= 1	; Reserved
;.equ	Res2	= 2	; Reserved
;.equ	Res3	= 3	; Reserved
.equ	PMU_IF_INV	= 4	; PMU IF Inverse
.equ	PMU_START	= 5	; Start of Phase Measurement Unit
.equ	PMU_EN	= 6	; Enable Phase Measurement Unit
.equ	Res7	= 7	; Reserved

; TRX_CTRL_1 - Transceiver Control Register 1
;.equ	Res0	= 0	; Reserved
;.equ	Res1	= 1	; Reserved
;.equ	Res2	= 2	; Reserved
;.equ	Res3	= 3	; Reserved
.equ	PLL_TX_FLT	= 4	; Enable PLL TX filter
.equ	TX_AUTO_CRC_ON	= 5	; Enable Automatic CRC Calculation
.equ	IRQ_2_EXT_EN	= 6	; Connect Frame Start IRQ to TC1
.equ	PA_EXT_EN	= 7	; External PA support enable

; PHY_TX_PWR - Transceiver Transmit Power Control Register
.equ	TX_PWR0	= 0	; Transmit Power Setting
.equ	TX_PWR1	= 1	; Transmit Power Setting
.equ	TX_PWR2	= 2	; Transmit Power Setting
.equ	TX_PWR3	= 3	; Transmit Power Setting
;.equ	Res0	= 4	; Reserved
;.equ	Res1	= 5	; Reserved
;.equ	Res2	= 6	; Reserved
;.equ	Res3	= 7	; Reserved

; PHY_RSSI - Receiver Signal Strength Indicator Register
.equ	RSSI0	= 0	; Receiver Signal Strength Indicator
.equ	RSSI1	= 1	; Receiver Signal Strength Indicator
.equ	RSSI2	= 2	; Receiver Signal Strength Indicator
.equ	RSSI3	= 3	; Receiver Signal Strength Indicator
.equ	RSSI4	= 4	; Receiver Signal Strength Indicator
.equ	RND_VALUE0	= 5	; Random Value
.equ	RND_VALUE1	= 6	; Random Value
.equ	RX_CRC_VALID	= 7	; Received Frame CRC Status

; PHY_ED_LEVEL - Transceiver Energy Detection Level Register
.equ	ED_LEVEL0	= 0	; Energy Detection Level
.equ	ED_LEVEL1	= 1	; Energy Detection Level
.equ	ED_LEVEL2	= 2	; Energy Detection Level
.equ	ED_LEVEL3	= 3	; Energy Detection Level
.equ	ED_LEVEL4	= 4	; Energy Detection Level
.equ	ED_LEVEL5	= 5	; Energy Detection Level
.equ	ED_LEVEL6	= 6	; Energy Detection Level
.equ	ED_LEVEL7	= 7	; Energy Detection Level

; PHY_CC_CCA - Transceiver Clear Channel Assessment (CCA) Control Register
.equ	CHANNEL0	= 0	; RX/TX Channel Selection
.equ	CHANNEL1	= 1	; RX/TX Channel Selection
.equ	CHANNEL2	= 2	; RX/TX Channel Selection
.equ	CHANNEL3	= 3	; RX/TX Channel Selection
.equ	CHANNEL4	= 4	; RX/TX Channel Selection
.equ	CCA_MODE0	= 5	; Select CCA Measurement Mode
.equ	CCA_MODE1	= 6	; Select CCA Measurement Mode
.equ	CCA_REQUEST	= 7	; Manual CCA Measurement Request

; CCA_THRES - Transceiver CCA Threshold Setting Register
.equ	CCA_ED_THRES0	= 0	; ED Threshold Level for CCA Measurement
.equ	CCA_ED_THRES1	= 1	; ED Threshold Level for CCA Measurement
.equ	CCA_ED_THRES2	= 2	; ED Threshold Level for CCA Measurement
.equ	CCA_ED_THRES3	= 3	; ED Threshold Level for CCA Measurement
.equ	CCA_CS_THRES0	= 4	; CS Threshold Level for CCA Measurement
.equ	CCA_CS_THRES1	= 5	; CS Threshold Level for CCA Measurement
.equ	CCA_CS_THRES2	= 6	; CS Threshold Level for CCA Measurement
.equ	CCA_CS_THRES3	= 7	; CS Threshold Level for CCA Measurement

; RX_CTRL - Transceiver Receive Control Register
.equ	PDT_THRES0	= 0	; Receiver Sensitivity Control
.equ	PDT_THRES1	= 1	; Receiver Sensitivity Control
.equ	PDT_THRES2	= 2	; Receiver Sensitivity Control
.equ	PDT_THRES3	= 3	; Receiver Sensitivity Control

; SFD_VALUE - Start of Frame Delimiter Value Register
.equ	SFD_VALUE0	= 0	; Start of Frame Delimiter Value
.equ	SFD_VALUE1	= 1	; Start of Frame Delimiter Value
.equ	SFD_VALUE2	= 2	; Start of Frame Delimiter Value
.equ	SFD_VALUE3	= 3	; Start of Frame Delimiter Value
.equ	SFD_VALUE4	= 4	; Start of Frame Delimiter Value
.equ	SFD_VALUE5	= 5	; Start of Frame Delimiter Value
.equ	SFD_VALUE6	= 6	; Start of Frame Delimiter Value
.equ	SFD_VALUE7	= 7	; Start of Frame Delimiter Value

; TRX_CTRL_2 - Transceiver Control Register 2
.equ	OQPSK_DATA_RATE0	= 0	; Data Rate Selection
.equ	OQPSK_DATA_RATE1	= 1	; Data Rate Selection
;.equ	Res0	= 2	; Reserved
;.equ	Res1	= 3	; Reserved
;.equ	Res2	= 4	; Reserved
;.equ	Res3	= 5	; Reserved
;.equ	Res4	= 6	; Reserved
.equ	RX_SAFE_MODE	= 7	; RX Safe Mode

; ANT_DIV - Antenna Diversity Control Register
.equ	ANT_CTRL0	= 0	; Static Antenna Diversity Switch Control
.equ	ANT_CTRL1	= 1	; Static Antenna Diversity Switch Control
.equ	ANT_EXT_SW_EN	= 2	; Enable External Antenna Switch Control
.equ	ANT_DIV_EN	= 3	; Enable Antenna Diversity
;.equ	Res0	= 4	; Reserved
;.equ	Res1	= 5	; Reserved
;.equ	Res2	= 6	; Reserved
.equ	ANT_SEL	= 7	; Antenna Diversity Antenna Status

; IRQ_MASK - Transceiver Interrupt Enable Register
.equ	PLL_LOCK_EN	= 0	; PLL Lock Interrupt Enable
.equ	PLL_UNLOCK_EN	= 1	; PLL Unlock Interrupt Enable
.equ	RX_START_EN	= 2	; RX_START Interrupt Enable
.equ	RX_END_EN	= 3	; RX_END Interrupt Enable
.equ	CCA_ED_DONE_EN	= 4	; End of ED Measurement Interrupt Enable
.equ	AMI_EN	= 5	; Address Match Interrupt Enable
.equ	TX_END_EN	= 6	; TX_END Interrupt Enable
.equ	AWAKE_EN	= 7	; Awake Interrupt Enable

; IRQ_STATUS - Transceiver Interrupt Status Register
.equ	PLL_LOCK	= 0	; PLL Lock Interrupt Status
.equ	PLL_UNLOCK	= 1	; PLL Unlock Interrupt Status
.equ	RX_START	= 2	; RX_START Interrupt Status
.equ	RX_END	= 3	; RX_END Interrupt Status
.equ	CCA_ED_DONE	= 4	; End of ED Measurement Interrupt Status
.equ	AMI	= 5	; Address Match Interrupt Status
.equ	TX_END	= 6	; TX_END Interrupt Status
.equ	AWAKE	= 7	; Awake Interrupt Status

