trol73/avr-make/asm/include/m256RFR2def.inc
; VREG_CTRL - Voltage Regulator Control and Status Register
.equ	DVDD_OK	= 2	; DVDD Supply Voltage Valid
.equ	DVREG_EXT	= 3	; Use External DVDD Regulator
.equ	AVDD_OK	= 6	; AVDD Supply Voltage Valid
.equ	AVREG_EXT	= 7	; Use External AVDD Regulator

; BATMON - Battery Monitor Control and Status Register
.equ	BATMON_VTH0	= 0	; Battery Monitor Threshold Voltage
.equ	BATMON_VTH1	= 1	; Battery Monitor Threshold Voltage
.equ	BATMON_VTH2	= 2	; Battery Monitor Threshold Voltage
.equ	BATMON_VTH3	= 3	; Battery Monitor Threshold Voltage
.equ	BATMON_HR	= 4	; Battery Monitor Voltage Range
.equ	BATMON_OK	= 5	; Battery Monitor Status
.equ	BAT_LOW_EN	= 6	; Battery Monitor Interrupt Enable
.equ	BAT_LOW	= 7	; Battery Monitor Interrupt Status

; XOSC_CTRL - Crystal Oscillator Control Register
.equ	XTAL_TRIM0	= 0	; Crystal Oscillator Load Capacitance Trimming
.equ	XTAL_TRIM1	= 1	; Crystal Oscillator Load Capacitance Trimming
.equ	XTAL_TRIM2	= 2	; Crystal Oscillator Load Capacitance Trimming
.equ	XTAL_TRIM3	= 3	; Crystal Oscillator Load Capacitance Trimming
.equ	XTAL_MODE0	= 4	; Crystal Oscillator Operating Mode
.equ	XTAL_MODE1	= 5	; Crystal Oscillator Operating Mode
.equ	XTAL_MODE2	= 6	; Crystal Oscillator Operating Mode
.equ	XTAL_MODE3	= 7	; Crystal Oscillator Operating Mode

; CC_CTRL_0 - Channel Control Register 0
.equ	CC_NUMBER0	= 0	; Channel Number
.equ	CC_NUMBER1	= 1	; Channel Number
.equ	CC_NUMBER2	= 2	; Channel Number
.equ	CC_NUMBER3	= 3	; Channel Number
.equ	CC_NUMBER4	= 4	; Channel Number
.equ	CC_NUMBER5	= 5	; Channel Number
.equ	CC_NUMBER6	= 6	; Channel Number
.equ	CC_NUMBER7	= 7	; Channel Number

; CC_CTRL_1 - Channel Control Register 1
.equ	CC_BAND0	= 0	; Channel Band
.equ	CC_BAND1	= 1	; Channel Band
.equ	CC_BAND2	= 2	; Channel Band
.equ	CC_BAND3	= 3	; Channel Band

; RX_SYN - Transceiver Receiver Sensitivity Control Register
.equ	RX_PDT_LEVEL0	= 0	; Reduce Receiver Sensitivity
.equ	RX_PDT_LEVEL1	= 1	; Reduce Receiver Sensitivity
.equ	RX_PDT_LEVEL2	= 2	; Reduce Receiver Sensitivity
.equ	RX_PDT_LEVEL3	= 3	; Reduce Receiver Sensitivity
;.equ	Res0	= 4	; Reserved
;.equ	Res1	= 5	; Reserved
.equ	RX_OVERRIDE	= 6	; Receiver Override Function
.equ	RX_PDT_DIS	= 7	; Prevent Frame Reception

; TRX_RPC - Transceiver Reduced Power Consumption Control
.equ	XAH_RPC_EN	= 0	; Smart Receiving in Extended Operating Modes Enable
.equ	IPAN_RPC_EN	= 1	; Smart Receiving Mode IPAN Handling Enable
;.equ	Res0	= 2	; Reserved
.equ	PLL_RPC_EN	= 3	; PLL Smart Receiving Mode Enable
.equ	PDT_RPC_EN	= 4	; Smart Receiving Mode Reduced Sensitivity Enable
.equ	RX_RPC_EN	= 5	; Reciver Smart Receiving Mode Enable
.equ	RX_RPC_CTRL0	= 6	; Smart Receiving Mode Timing
.equ	RX_RPC_CTRL1	= 7	; Smart Receiving Mode Timing

; XAH_CTRL_1 - Transceiver Acknowledgment Frame Control Register 1
;.equ	Res	= 0	; Reserved Bit
.equ	AACK_PROM_MODE	= 1	; Enable Promiscuous Mode
.equ	AACK_ACK_TIME	= 2	; Reduce Acknowledgment Time
;.equ	Res	= 3	; Reserved Bit
.equ	AACK_UPLD_RES_FT	= 4	; Process Reserved Frames
.equ	AACK_FLTR_RES_FT	= 5	; Filter Reserved Frames
;.equ	Res0	= 6	; Reserved Bit
;.equ	Res1	= 7	; Reserved Bit

; FTN_CTRL - Transceiver Filter Tuning Control Register
.equ	FTN_START	= 7	; Start Calibration Loop of Filter Tuning Network

; PLL_CF - Transceiver Center Frequency Calibration Control Register
.equ	PLL_CF_START	= 7	; Start Center Frequency Calibration

; PLL_DCU - Transceiver Delay Cell Calibration Control Register
.equ	PLL_DCU_START	= 7	; Start Delay Cell Calibration

; PART_NUM - Device Identification Register (Part Number)
.equ	PART_NUM0	= 0	; Part Number
.equ	PART_NUM1	= 1	; Part Number
.equ	PART_NUM2	= 2	; Part Number
.equ	PART_NUM3	= 3	; Part Number
.equ	PART_NUM4	= 4	; Part Number
.equ	PART_NUM5	= 5	; Part Number
.equ	PART_NUM6	= 6	; Part Number
.equ	PART_NUM7	= 7	; Part Number

; VERSION_NUM - Device Identification Register (Version Number)
.equ	VERSION_NUM0	= 0	; Version Number
.equ	VERSION_NUM1	= 1	; Version Number
.equ	VERSION_NUM2	= 2	; Version Number
.equ	VERSION_NUM3	= 3	; Version Number
.equ	VERSION_NUM4	= 4	; Version Number
.equ	VERSION_NUM5	= 5	; Version Number
.equ	VERSION_NUM6	= 6	; Version Number
.equ	VERSION_NUM7	= 7	; Version Number

; MAN_ID_0 - Device Identification Register (Manufacture ID Low Byte)
.equ	MAN_ID_00	= 0	; Manufacturer ID (Low Byte)
.equ	MAN_ID_01	= 1	; Manufacturer ID (Low Byte)
.equ	MAN_ID_02	= 2	; Manufacturer ID (Low Byte)
.equ	MAN_ID_03	= 3	; Manufacturer ID (Low Byte)
.equ	MAN_ID_04	= 4	; Manufacturer ID (Low Byte)
.equ	MAN_ID_05	= 5	; Manufacturer ID (Low Byte)
.equ	MAN_ID_06	= 6	; Manufacturer ID (Low Byte)
.equ	MAN_ID_07	= 7	; Manufacturer ID (Low Byte)

; MAN_ID_1 - Device Identification Register (Manufacture ID High Byte)
.equ	MAN_ID_10	= 0	; Manufacturer ID (High Byte)
.equ	MAN_ID_11	= 1	; Manufacturer ID (High Byte)
.equ	MAN_ID_12	= 2	; Manufacturer ID (High Byte)
.equ	MAN_ID_13	= 3	; Manufacturer ID (High Byte)
.equ	MAN_ID_14	= 4	; Manufacturer ID (High Byte)
.equ	MAN_ID_15	= 5	; Manufacturer ID (High Byte)
.equ	MAN_ID_16	= 6	; Manufacturer ID (High Byte)
.equ	MAN_ID_17	= 7	; Manufacturer ID (High Byte)

; SHORT_ADDR_0 - Transceiver MAC Short Address Register (Low Byte)
.equ	SHORT_ADDR_00	= 0	; MAC Short Address
.equ	SHORT_ADDR_01	= 1	; MAC Short Address
.equ	SHORT_ADDR_02	= 2	; MAC Short Address
.equ	SHORT_ADDR_03	= 3	; MAC Short Address
.equ	SHORT_ADDR_04	= 4	; MAC Short Address
.equ	SHORT_ADDR_05	= 5	; MAC Short Address
.equ	SHORT_ADDR_06	= 6	; MAC Short Address
.equ	SHORT_ADDR_07	= 7	; MAC Short Address

; SHORT_ADDR_1 - Transceiver MAC Short Address Register (High Byte)
.equ	SHORT_ADDR_10	= 0	; MAC Short Address
.equ	SHORT_ADDR_11	= 1	; MAC Short Address
.equ	SHORT_ADDR_12	= 2	; MAC Short Address
.equ	SHORT_ADDR_13	= 3	; MAC Short Address
.equ	SHORT_ADDR_14	= 4	; MAC Short Address
.equ	SHORT_ADDR_15	= 5	; MAC Short Address
.equ	SHORT_ADDR_16	= 6	; MAC Short Address
.equ	SHORT_ADDR_17	= 7	; MAC Short Address

; PAN_ID_0 - Transceiver Personal Area Network ID Register (Low Byte)
.equ	PAN_ID_00	= 0	; MAC Personal Area Network ID
.equ	PAN_ID_01	= 1	; MAC Personal Area Network ID
.equ	PAN_ID_02	= 2	; MAC Personal Area Network ID
.equ	PAN_ID_03	= 3	; MAC Personal Area Network ID
.equ	PAN_ID_04	= 4	; MAC Personal Area Network ID
.equ	PAN_ID_05	= 5	; MAC Personal Area Network ID
.equ	PAN_ID_06	= 6	; MAC Personal Area Network ID
.equ	PAN_ID_07	= 7	; MAC Personal Area Network ID

; PAN_ID_1 - Transceiver Personal Area Network ID Register (High Byte)
.equ	PAN_ID_10	= 0	; MAC Personal Area Network ID
.equ	PAN_ID_11	= 1	; MAC Personal Area Network ID
.equ	PAN_ID_12	= 2	; MAC Personal Area Network ID
.equ	PAN_ID_13	= 3	; MAC Personal Area Network ID
.equ	PAN_ID_14	= 4	; MAC Personal Area Network ID
.equ	PAN_ID_15	= 5	; MAC Personal Area Network ID
.equ	PAN_ID_16	= 6	; MAC Personal Area Network ID
.equ	PAN_ID_17	= 7	; MAC Personal Area Network ID

; IEEE_ADDR_0 - Transceiver MAC IEEE Address Register 0
.equ	IEEE_ADDR_00	= 0	; MAC IEEE Address
.equ	IEEE_ADDR_01	= 1	; MAC IEEE Address
.equ	IEEE_ADDR_02	= 2	; MAC IEEE Address
.equ	IEEE_ADDR_03	= 3	; MAC IEEE Address
.equ	IEEE_ADDR_04	= 4	; MAC IEEE Address
.equ	IEEE_ADDR_05	= 5	; MAC IEEE Address
.equ	IEEE_ADDR_06	= 6	; MAC IEEE Address
.equ	IEEE_ADDR_07	= 7	; MAC IEEE Address

