trol73/avr-make/asm/include/m256RFR2def.inc
; IEEE_ADDR_1 - Transceiver MAC IEEE Address Register 1
.equ	IEEE_ADDR_10	= 0	; MAC IEEE Address
.equ	IEEE_ADDR_11	= 1	; MAC IEEE Address
.equ	IEEE_ADDR_12	= 2	; MAC IEEE Address
.equ	IEEE_ADDR_13	= 3	; MAC IEEE Address
.equ	IEEE_ADDR_14	= 4	; MAC IEEE Address
.equ	IEEE_ADDR_15	= 5	; MAC IEEE Address
.equ	IEEE_ADDR_16	= 6	; MAC IEEE Address
.equ	IEEE_ADDR_17	= 7	; MAC IEEE Address

; IEEE_ADDR_2 - Transceiver MAC IEEE Address Register 2
.equ	IEEE_ADDR_20	= 0	; MAC IEEE Address
.equ	IEEE_ADDR_21	= 1	; MAC IEEE Address
.equ	IEEE_ADDR_22	= 2	; MAC IEEE Address
.equ	IEEE_ADDR_23	= 3	; MAC IEEE Address
.equ	IEEE_ADDR_24	= 4	; MAC IEEE Address
.equ	IEEE_ADDR_25	= 5	; MAC IEEE Address
.equ	IEEE_ADDR_26	= 6	; MAC IEEE Address
.equ	IEEE_ADDR_27	= 7	; MAC IEEE Address

; IEEE_ADDR_3 - Transceiver MAC IEEE Address Register 3
.equ	IEEE_ADDR_30	= 0	; MAC IEEE Address
.equ	IEEE_ADDR_31	= 1	; MAC IEEE Address
.equ	IEEE_ADDR_32	= 2	; MAC IEEE Address
.equ	IEEE_ADDR_33	= 3	; MAC IEEE Address
.equ	IEEE_ADDR_34	= 4	; MAC IEEE Address
.equ	IEEE_ADDR_35	= 5	; MAC IEEE Address
.equ	IEEE_ADDR_36	= 6	; MAC IEEE Address
.equ	IEEE_ADDR_37	= 7	; MAC IEEE Address

; IEEE_ADDR_4 - Transceiver MAC IEEE Address Register 4
.equ	IEEE_ADDR_40	= 0	; MAC IEEE Address
.equ	IEEE_ADDR_41	= 1	; MAC IEEE Address
.equ	IEEE_ADDR_42	= 2	; MAC IEEE Address
.equ	IEEE_ADDR_43	= 3	; MAC IEEE Address
.equ	IEEE_ADDR_44	= 4	; MAC IEEE Address
.equ	IEEE_ADDR_45	= 5	; MAC IEEE Address
.equ	IEEE_ADDR_46	= 6	; MAC IEEE Address
.equ	IEEE_ADDR_47	= 7	; MAC IEEE Address

; IEEE_ADDR_5 - Transceiver MAC IEEE Address Register 5
.equ	IEEE_ADDR_50	= 0	; MAC IEEE Address
.equ	IEEE_ADDR_51	= 1	; MAC IEEE Address
.equ	IEEE_ADDR_52	= 2	; MAC IEEE Address
.equ	IEEE_ADDR_53	= 3	; MAC IEEE Address
.equ	IEEE_ADDR_54	= 4	; MAC IEEE Address
.equ	IEEE_ADDR_55	= 5	; MAC IEEE Address
.equ	IEEE_ADDR_56	= 6	; MAC IEEE Address
.equ	IEEE_ADDR_57	= 7	; MAC IEEE Address

; IEEE_ADDR_6 - Transceiver MAC IEEE Address Register 6
.equ	IEEE_ADDR_60	= 0	; MAC IEEE Address
.equ	IEEE_ADDR_61	= 1	; MAC IEEE Address
.equ	IEEE_ADDR_62	= 2	; MAC IEEE Address
.equ	IEEE_ADDR_63	= 3	; MAC IEEE Address
.equ	IEEE_ADDR_64	= 4	; MAC IEEE Address
.equ	IEEE_ADDR_65	= 5	; MAC IEEE Address
.equ	IEEE_ADDR_66	= 6	; MAC IEEE Address
.equ	IEEE_ADDR_67	= 7	; MAC IEEE Address

; IEEE_ADDR_7 - Transceiver MAC IEEE Address Register 7
.equ	IEEE_ADDR_70	= 0	; MAC IEEE Address
.equ	IEEE_ADDR_71	= 1	; MAC IEEE Address
.equ	IEEE_ADDR_72	= 2	; MAC IEEE Address
.equ	IEEE_ADDR_73	= 3	; MAC IEEE Address
.equ	IEEE_ADDR_74	= 4	; MAC IEEE Address
.equ	IEEE_ADDR_75	= 5	; MAC IEEE Address
.equ	IEEE_ADDR_76	= 6	; MAC IEEE Address
.equ	IEEE_ADDR_77	= 7	; MAC IEEE Address

; XAH_CTRL_0 - Transceiver Extended Operating Mode Control Register
.equ	SLOTTED_OPERATION	= 0	; Set Slotted Acknowledgment
.equ	MAX_CSMA_RETRIES0	= 1	; Maximum Number of CSMA-CA Procedure Repetition Attempts
.equ	MAX_CSMA_RETRIES1	= 2	; Maximum Number of CSMA-CA Procedure Repetition Attempts
.equ	MAX_CSMA_RETRIES2	= 3	; Maximum Number of CSMA-CA Procedure Repetition Attempts
.equ	MAX_FRAME_RETRIES0	= 4	; Maximum Number of Frame Re-transmission Attempts
.equ	MAX_FRAME_RETRIES1	= 5	; Maximum Number of Frame Re-transmission Attempts
.equ	MAX_FRAME_RETRIES2	= 6	; Maximum Number of Frame Re-transmission Attempts
.equ	MAX_FRAME_RETRIES3	= 7	; Maximum Number of Frame Re-transmission Attempts

; CSMA_SEED_0 - Transceiver CSMA-CA Random Number Generator Seed Register
.equ	CSMA_SEED_00	= 0	; Seed Value for CSMA Random Number Generator
.equ	CSMA_SEED_01	= 1	; Seed Value for CSMA Random Number Generator
.equ	CSMA_SEED_02	= 2	; Seed Value for CSMA Random Number Generator
.equ	CSMA_SEED_03	= 3	; Seed Value for CSMA Random Number Generator
.equ	CSMA_SEED_04	= 4	; Seed Value for CSMA Random Number Generator
.equ	CSMA_SEED_05	= 5	; Seed Value for CSMA Random Number Generator
.equ	CSMA_SEED_06	= 6	; Seed Value for CSMA Random Number Generator
.equ	CSMA_SEED_07	= 7	; Seed Value for CSMA Random Number Generator

; CSMA_SEED_1 - Transceiver Acknowledgment Frame Control Register 2
.equ	CSMA_SEED_10	= 0	; Seed Value for CSMA Random Number Generator
.equ	CSMA_SEED_11	= 1	; Seed Value for CSMA Random Number Generator
.equ	CSMA_SEED_12	= 2	; Seed Value for CSMA Random Number Generator
.equ	AACK_I_AM_COORD	= 3	; Set Personal Area Network Coordinator
.equ	AACK_DIS_ACK	= 4	; Disable Acknowledgment Frame Transmission
.equ	AACK_SET_PD	= 5	; Set Frame Pending Sub-field
.equ	AACK_FVN_MODE0	= 6	; Acknowledgment Frame Filter Mode
.equ	AACK_FVN_MODE1	= 7	; Acknowledgment Frame Filter Mode

; CSMA_BE - Transceiver CSMA-CA Back-off Exponent Control Register
.equ	MIN_BE0	= 0	; Minimum Back-off Exponent
.equ	MIN_BE1	= 1	; Minimum Back-off Exponent
.equ	MIN_BE2	= 2	; Minimum Back-off Exponent
.equ	MIN_BE3	= 3	; Minimum Back-off Exponent
.equ	MAX_BE0	= 4	; Maximum Back-off Exponent
.equ	MAX_BE1	= 5	; Maximum Back-off Exponent
.equ	MAX_BE2	= 6	; Maximum Back-off Exponent
.equ	MAX_BE3	= 7	; Maximum Back-off Exponent

; TST_CTRL_DIGI - Transceiver Digital Test Control Register
.equ	TST_CTRL_DIG0	= 0	; Digital Test Controller Register
.equ	TST_CTRL_DIG1	= 1	; Digital Test Controller Register
.equ	TST_CTRL_DIG2	= 2	; Digital Test Controller Register
.equ	TST_CTRL_DIG3	= 3	; Digital Test Controller Register

; TST_RX_LENGTH - Transceiver Received Frame Length Register
.equ	RX_LENGTH0	= 0	; Received Frame Length
.equ	RX_LENGTH1	= 1	; Received Frame Length
.equ	RX_LENGTH2	= 2	; Received Frame Length
.equ	RX_LENGTH3	= 3	; Received Frame Length
.equ	RX_LENGTH4	= 4	; Received Frame Length
.equ	RX_LENGTH5	= 5	; Received Frame Length
.equ	RX_LENGTH6	= 6	; Received Frame Length
.equ	RX_LENGTH7	= 7	; Received Frame Length

; TRXFBST - Start of frame buffer
.equ	TRXFBST0	= 0	; Frame Buffer Start Byte
.equ	TRXFBST1	= 1	; Frame Buffer Start Byte
.equ	TRXFBST2	= 2	; Frame Buffer Start Byte
.equ	TRXFBST3	= 3	; Frame Buffer Start Byte
.equ	TRXFBST4	= 4	; Frame Buffer Start Byte
.equ	TRXFBST5	= 5	; Frame Buffer Start Byte
.equ	TRXFBST6	= 6	; Frame Buffer Start Byte
.equ	TRXFBST7	= 7	; Frame Buffer Start Byte

; TRXFBEND - End of frame buffer
.equ	TRXFBEND0	= 0	; Frame Buffer End Byte
.equ	TRXFBEND1	= 1	; Frame Buffer End Byte
.equ	TRXFBEND2	= 2	; Frame Buffer End Byte
.equ	TRXFBEND3	= 3	; Frame Buffer End Byte
.equ	TRXFBEND4	= 4	; Frame Buffer End Byte
.equ	TRXFBEND5	= 5	; Frame Buffer End Byte
.equ	TRXFBEND6	= 6	; Frame Buffer End Byte
.equ	TRXFBEND7	= 7	; Frame Buffer End Byte


; ***** SYMCNT ***********************
; SCTSTRHH - Symbol Counter Transmit Frame Timestamp Register HH-Byte
.equ	SCTSTRHH0	= 0	; Symbol Counter Transmit Frame Timestamp Register HH-Byte
.equ	SCTSTRHH1	= 1	; Symbol Counter Transmit Frame Timestamp Register HH-Byte
.equ	SCTSTRHH2	= 2	; Symbol Counter Transmit Frame Timestamp Register HH-Byte
.equ	SCTSTRHH3	= 3	; Symbol Counter Transmit Frame Timestamp Register HH-Byte
.equ	SCTSTRHH4	= 4	; Symbol Counter Transmit Frame Timestamp Register HH-Byte
.equ	SCTSTRHH5	= 5	; Symbol Counter Transmit Frame Timestamp Register HH-Byte
.equ	SCTSTRHH6	= 6	; Symbol Counter Transmit Frame Timestamp Register HH-Byte
.equ	SCTSTRHH7	= 7	; Symbol Counter Transmit Frame Timestamp Register HH-Byte

