trol73/avr-make/asm/include/m256RFR2def.inc
; SCTSTRHL - Symbol Counter Transmit Frame Timestamp Register HL-Byte
.equ	SCTSTRHL0	= 0	; Symbol Counter Transmit Frame Timestamp Register HL-Byte
.equ	SCTSTRHL1	= 1	; Symbol Counter Transmit Frame Timestamp Register HL-Byte
.equ	SCTSTRHL2	= 2	; Symbol Counter Transmit Frame Timestamp Register HL-Byte
.equ	SCTSTRHL3	= 3	; Symbol Counter Transmit Frame Timestamp Register HL-Byte
.equ	SCTSTRHL4	= 4	; Symbol Counter Transmit Frame Timestamp Register HL-Byte
.equ	SCTSTRHL5	= 5	; Symbol Counter Transmit Frame Timestamp Register HL-Byte
.equ	SCTSTRHL6	= 6	; Symbol Counter Transmit Frame Timestamp Register HL-Byte
.equ	SCTSTRHL7	= 7	; Symbol Counter Transmit Frame Timestamp Register HL-Byte

; SCTSTRLH - Symbol Counter Transmit Frame Timestamp Register LH-Byte
.equ	SCTSTRLH0	= 0	; Symbol Counter Transmit Frame Timestamp Register LH-Byte
.equ	SCTSTRLH1	= 1	; Symbol Counter Transmit Frame Timestamp Register LH-Byte
.equ	SCTSTRLH2	= 2	; Symbol Counter Transmit Frame Timestamp Register LH-Byte
.equ	SCTSTRLH3	= 3	; Symbol Counter Transmit Frame Timestamp Register LH-Byte
.equ	SCTSTRLH4	= 4	; Symbol Counter Transmit Frame Timestamp Register LH-Byte
.equ	SCTSTRLH5	= 5	; Symbol Counter Transmit Frame Timestamp Register LH-Byte
.equ	SCTSTRLH6	= 6	; Symbol Counter Transmit Frame Timestamp Register LH-Byte
.equ	SCTSTRLH7	= 7	; Symbol Counter Transmit Frame Timestamp Register LH-Byte

; SCTSTRLL - Symbol Counter Transmit Frame Timestamp Register LL-Byte
.equ	SCTSTRLL0	= 0	; Symbol Counter Transmit Frame Timestamp Register LL-Byte
.equ	SCTSTRLL1	= 1	; Symbol Counter Transmit Frame Timestamp Register LL-Byte
.equ	SCTSTRLL2	= 2	; Symbol Counter Transmit Frame Timestamp Register LL-Byte
.equ	SCTSTRLL3	= 3	; Symbol Counter Transmit Frame Timestamp Register LL-Byte
.equ	SCTSTRLL4	= 4	; Symbol Counter Transmit Frame Timestamp Register LL-Byte
.equ	SCTSTRLL5	= 5	; Symbol Counter Transmit Frame Timestamp Register LL-Byte
.equ	SCTSTRLL6	= 6	; Symbol Counter Transmit Frame Timestamp Register LL-Byte
.equ	SCTSTRLL7	= 7	; Symbol Counter Transmit Frame Timestamp Register LL-Byte

; SCOCR1HH - Symbol Counter Output Compare Register 1 HH-Byte
.equ	SCOCR1HH0	= 0	; Symbol Counter Output Compare Register 1 HH-Byte
.equ	SCOCR1HH1	= 1	; Symbol Counter Output Compare Register 1 HH-Byte
.equ	SCOCR1HH2	= 2	; Symbol Counter Output Compare Register 1 HH-Byte
.equ	SCOCR1HH3	= 3	; Symbol Counter Output Compare Register 1 HH-Byte
.equ	SCOCR1HH4	= 4	; Symbol Counter Output Compare Register 1 HH-Byte
.equ	SCOCR1HH5	= 5	; Symbol Counter Output Compare Register 1 HH-Byte
.equ	SCOCR1HH6	= 6	; Symbol Counter Output Compare Register 1 HH-Byte
.equ	SCOCR1HH7	= 7	; Symbol Counter Output Compare Register 1 HH-Byte

; SCOCR1HL - Symbol Counter Output Compare Register 1 HL-Byte
.equ	SCOCR1HL0	= 0	; Symbol Counter Output Compare Register 1 HL-Byte
.equ	SCOCR1HL1	= 1	; Symbol Counter Output Compare Register 1 HL-Byte
.equ	SCOCR1HL2	= 2	; Symbol Counter Output Compare Register 1 HL-Byte
.equ	SCOCR1HL3	= 3	; Symbol Counter Output Compare Register 1 HL-Byte
.equ	SCOCR1HL4	= 4	; Symbol Counter Output Compare Register 1 HL-Byte
.equ	SCOCR1HL5	= 5	; Symbol Counter Output Compare Register 1 HL-Byte
.equ	SCOCR1HL6	= 6	; Symbol Counter Output Compare Register 1 HL-Byte
.equ	SCOCR1HL7	= 7	; Symbol Counter Output Compare Register 1 HL-Byte

; SCOCR1LH - Symbol Counter Output Compare Register 1 LH-Byte
.equ	SCOCR1LH0	= 0	; Symbol Counter Output Compare Register 1 LH-Byte
.equ	SCOCR1LH1	= 1	; Symbol Counter Output Compare Register 1 LH-Byte
.equ	SCOCR1LH2	= 2	; Symbol Counter Output Compare Register 1 LH-Byte
.equ	SCOCR1LH3	= 3	; Symbol Counter Output Compare Register 1 LH-Byte
.equ	SCOCR1LH4	= 4	; Symbol Counter Output Compare Register 1 LH-Byte
.equ	SCOCR1LH5	= 5	; Symbol Counter Output Compare Register 1 LH-Byte
.equ	SCOCR1LH6	= 6	; Symbol Counter Output Compare Register 1 LH-Byte
.equ	SCOCR1LH7	= 7	; Symbol Counter Output Compare Register 1 LH-Byte

; SCOCR1LL - Symbol Counter Output Compare Register 1 LL-Byte
.equ	SCOCR1LL0	= 0	; Symbol Counter Output Compare Register 1 LL-Byte
.equ	SCOCR1LL1	= 1	; Symbol Counter Output Compare Register 1 LL-Byte
.equ	SCOCR1LL2	= 2	; Symbol Counter Output Compare Register 1 LL-Byte
.equ	SCOCR1LL3	= 3	; Symbol Counter Output Compare Register 1 LL-Byte
.equ	SCOCR1LL4	= 4	; Symbol Counter Output Compare Register 1 LL-Byte
.equ	SCOCR1LL5	= 5	; Symbol Counter Output Compare Register 1 LL-Byte
.equ	SCOCR1LL6	= 6	; Symbol Counter Output Compare Register 1 LL-Byte
.equ	SCOCR1LL7	= 7	; Symbol Counter Output Compare Register 1 LL-Byte

; SCOCR2HH - Symbol Counter Output Compare Register 2 HH-Byte
.equ	SCOCR2HH0	= 0	; Symbol Counter Output Compare Register 2 HH-Byte
.equ	SCOCR2HH1	= 1	; Symbol Counter Output Compare Register 2 HH-Byte
.equ	SCOCR2HH2	= 2	; Symbol Counter Output Compare Register 2 HH-Byte
.equ	SCOCR2HH3	= 3	; Symbol Counter Output Compare Register 2 HH-Byte
.equ	SCOCR2HH4	= 4	; Symbol Counter Output Compare Register 2 HH-Byte
.equ	SCOCR2HH5	= 5	; Symbol Counter Output Compare Register 2 HH-Byte
.equ	SCOCR2HH6	= 6	; Symbol Counter Output Compare Register 2 HH-Byte
.equ	SCOCR2HH7	= 7	; Symbol Counter Output Compare Register 2 HH-Byte

; SCOCR2HL - Symbol Counter Output Compare Register 2 HL-Byte
.equ	SCOCR2HL0	= 0	; Symbol Counter Output Compare Register 2 HL-Byte
.equ	SCOCR2HL1	= 1	; Symbol Counter Output Compare Register 2 HL-Byte
.equ	SCOCR2HL2	= 2	; Symbol Counter Output Compare Register 2 HL-Byte
.equ	SCOCR2HL3	= 3	; Symbol Counter Output Compare Register 2 HL-Byte
.equ	SCOCR2HL4	= 4	; Symbol Counter Output Compare Register 2 HL-Byte
.equ	SCOCR2HL5	= 5	; Symbol Counter Output Compare Register 2 HL-Byte
.equ	SCOCR2HL6	= 6	; Symbol Counter Output Compare Register 2 HL-Byte
.equ	SCOCR2HL7	= 7	; Symbol Counter Output Compare Register 2 HL-Byte

; SCOCR2LH - Symbol Counter Output Compare Register 2 LH-Byte
.equ	SCOCR2LH0	= 0	; Symbol Counter Output Compare Register 2 LH-Byte
.equ	SCOCR2LH1	= 1	; Symbol Counter Output Compare Register 2 LH-Byte
.equ	SCOCR2LH2	= 2	; Symbol Counter Output Compare Register 2 LH-Byte
.equ	SCOCR2LH3	= 3	; Symbol Counter Output Compare Register 2 LH-Byte
.equ	SCOCR2LH4	= 4	; Symbol Counter Output Compare Register 2 LH-Byte
.equ	SCOCR2LH5	= 5	; Symbol Counter Output Compare Register 2 LH-Byte
.equ	SCOCR2LH6	= 6	; Symbol Counter Output Compare Register 2 LH-Byte
.equ	SCOCR2LH7	= 7	; Symbol Counter Output Compare Register 2 LH-Byte

