trol73/avr-make/asm/include/m256RFR2def.inc
; SCBTSRHL - Symbol Counter Beacon Timestamp Register HL-Byte
.equ	SCBTSRHL0	= 0	; Symbol Counter Beacon Timestamp Register HL-Byte
.equ	SCBTSRHL1	= 1	; Symbol Counter Beacon Timestamp Register HL-Byte
.equ	SCBTSRHL2	= 2	; Symbol Counter Beacon Timestamp Register HL-Byte
.equ	SCBTSRHL3	= 3	; Symbol Counter Beacon Timestamp Register HL-Byte
.equ	SCBTSRHL4	= 4	; Symbol Counter Beacon Timestamp Register HL-Byte
.equ	SCBTSRHL5	= 5	; Symbol Counter Beacon Timestamp Register HL-Byte
.equ	SCBTSRHL6	= 6	; Symbol Counter Beacon Timestamp Register HL-Byte
.equ	SCBTSRHL7	= 7	; Symbol Counter Beacon Timestamp Register HL-Byte

; SCBTSRLH - Symbol Counter Beacon Timestamp Register LH-Byte
.equ	SCBTSRLH0	= 0	; Symbol Counter Beacon Timestamp Register LH-Byte
.equ	SCBTSRLH1	= 1	; Symbol Counter Beacon Timestamp Register LH-Byte
.equ	SCBTSRLH2	= 2	; Symbol Counter Beacon Timestamp Register LH-Byte
.equ	SCBTSRLH3	= 3	; Symbol Counter Beacon Timestamp Register LH-Byte
.equ	SCBTSRLH4	= 4	; Symbol Counter Beacon Timestamp Register LH-Byte
.equ	SCBTSRLH5	= 5	; Symbol Counter Beacon Timestamp Register LH-Byte
.equ	SCBTSRLH6	= 6	; Symbol Counter Beacon Timestamp Register LH-Byte
.equ	SCBTSRLH7	= 7	; Symbol Counter Beacon Timestamp Register LH-Byte

; SCBTSRLL - Symbol Counter Beacon Timestamp Register LL-Byte
.equ	SCBTSRLL0	= 0	; Symbol Counter Beacon Timestamp Register LL-Byte
.equ	SCBTSRLL1	= 1	; Symbol Counter Beacon Timestamp Register LL-Byte
.equ	SCBTSRLL2	= 2	; Symbol Counter Beacon Timestamp Register LL-Byte
.equ	SCBTSRLL3	= 3	; Symbol Counter Beacon Timestamp Register LL-Byte
.equ	SCBTSRLL4	= 4	; Symbol Counter Beacon Timestamp Register LL-Byte
.equ	SCBTSRLL5	= 5	; Symbol Counter Beacon Timestamp Register LL-Byte
.equ	SCBTSRLL6	= 6	; Symbol Counter Beacon Timestamp Register LL-Byte
.equ	SCBTSRLL7	= 7	; Symbol Counter Beacon Timestamp Register LL-Byte

; SCCNTHH - Symbol Counter Register HH-Byte
.equ	SCCNTHH0	= 0	; Symbol Counter Register HH-Byte
.equ	SCCNTHH1	= 1	; Symbol Counter Register HH-Byte
.equ	SCCNTHH2	= 2	; Symbol Counter Register HH-Byte
.equ	SCCNTHH3	= 3	; Symbol Counter Register HH-Byte
.equ	SCCNTHH4	= 4	; Symbol Counter Register HH-Byte
.equ	SCCNTHH5	= 5	; Symbol Counter Register HH-Byte
.equ	SCCNTHH6	= 6	; Symbol Counter Register HH-Byte
.equ	SCCNTHH7	= 7	; Symbol Counter Register HH-Byte

; SCCNTHL - Symbol Counter Register HL-Byte
.equ	SCCNTHL0	= 0	; Symbol Counter Register HL-Byte
.equ	SCCNTHL1	= 1	; Symbol Counter Register HL-Byte
.equ	SCCNTHL2	= 2	; Symbol Counter Register HL-Byte
.equ	SCCNTHL3	= 3	; Symbol Counter Register HL-Byte
.equ	SCCNTHL4	= 4	; Symbol Counter Register HL-Byte
.equ	SCCNTHL5	= 5	; Symbol Counter Register HL-Byte
.equ	SCCNTHL6	= 6	; Symbol Counter Register HL-Byte
.equ	SCCNTHL7	= 7	; Symbol Counter Register HL-Byte

; SCCNTLH - Symbol Counter Register LH-Byte
.equ	SCCNTLH0	= 0	; Symbol Counter Register LH-Byte
.equ	SCCNTLH1	= 1	; Symbol Counter Register LH-Byte
.equ	SCCNTLH2	= 2	; Symbol Counter Register LH-Byte
.equ	SCCNTLH3	= 3	; Symbol Counter Register LH-Byte
.equ	SCCNTLH4	= 4	; Symbol Counter Register LH-Byte
.equ	SCCNTLH5	= 5	; Symbol Counter Register LH-Byte
.equ	SCCNTLH6	= 6	; Symbol Counter Register LH-Byte
.equ	SCCNTLH7	= 7	; Symbol Counter Register LH-Byte

; SCCNTLL - Symbol Counter Register LL-Byte
.equ	SCCNTLL0	= 0	; Symbol Counter Register LL-Byte
.equ	SCCNTLL1	= 1	; Symbol Counter Register LL-Byte
.equ	SCCNTLL2	= 2	; Symbol Counter Register LL-Byte
.equ	SCCNTLL3	= 3	; Symbol Counter Register LL-Byte
.equ	SCCNTLL4	= 4	; Symbol Counter Register LL-Byte
.equ	SCCNTLL5	= 5	; Symbol Counter Register LL-Byte
.equ	SCCNTLL6	= 6	; Symbol Counter Register LL-Byte
.equ	SCCNTLL7	= 7	; Symbol Counter Register LL-Byte

; SCCR0 - Symbol Counter Control Register 0
.equ	SCCMP1	= 0	; Symbol Counter Compare Unit 1 Mode select
.equ	SCCMP2	= 1	; Symbol Counter Compare Unit 2 Mode select
.equ	SCCMP3	= 2	; Symbol Counter Compare Unit 3 Mode select
.equ	SCTSE	= 3	; Symbol Counter Automatic Timestamping enable
.equ	SCCKSEL	= 4	; Symbol Counter Clock Source select
.equ	SCEN	= 5	; Symbol Counter enable
.equ	SCMBTS	= 6	; Manual Beacon Timestamp
.equ	SCRES	= 7	; Symbol Counter Synchronization

; SCCR1 - Symbol Counter Control Register 1
.equ	SCENBO	= 0	; Backoff Slot Counter enable
.equ	SCEECLK	= 1	; Enable External Clock Source on PG2
.equ	SCCKDIV0	= 2	; Clock divider for synchronous clock source (16MHz Transceiver Clock)
.equ	SCCKDIV1	= 3	; Clock divider for synchronous clock source (16MHz Transceiver Clock)
.equ	SCCKDIV2	= 4	; Clock divider for synchronous clock source (16MHz Transceiver Clock)
.equ	SCBTSM	= 5	; Symbol Counter Beacon Timestamp Mask Register
;.equ	Res5	= 6	; Reserved Bit
.equ	Res6	= 7	; Reserved Bit

; SCCSR - Symbol Counter Compare Source Register
.equ	SCCS10	= 0	; Symbol Counter Compare Source select register for Compare Unit 1
.equ	SCCS11	= 1	; Symbol Counter Compare Source select register for Compare Unit 1
.equ	SCCS20	= 2	; Symbol Counter Compare Source select register for Compare Unit 2
.equ	SCCS21	= 3	; Symbol Counter Compare Source select register for Compare Unit 2
.equ	SCCS30	= 4	; Symbol Counter Compare Source select register for Compare Unit 3
.equ	SCCS31	= 5	; Symbol Counter Compare Source select register for Compare Unit 3
;.equ	Res0	= 6	; Reserved Bit
;.equ	Res1	= 7	; Reserved Bit

; SCSR - Symbol Counter Status Register
.equ	SCBSY	= 0	; Symbol Counter busy
;.equ	Res0	= 1	; Reserved Bit
;.equ	Res1	= 2	; Reserved Bit
;.equ	Res2	= 3	; Reserved Bit
;.equ	Res3	= 4	; Reserved Bit
;.equ	Res4	= 5	; Reserved Bit
;.equ	Res5	= 6	; Reserved Bit
;.equ	Res6	= 7	; Reserved Bit

; SCIRQS - Symbol Counter Interrupt Status Register
.equ	IRQSCP1	= 0	; Compare Unit 1 Compare Match IRQ
.equ	IRQSCP2	= 1	; Compare Unit 2 Compare Match IRQ
.equ	IRQSCP3	= 2	; Compare Unit 3 Compare Match IRQ
.equ	IRQSOF	= 3	; Symbol Counter Overflow IRQ
.equ	IRQSBO	= 4	; Backoff Slot Counter IRQ
;.equ	Res0	= 5	; Reserved Bit
;.equ	Res1	= 6	; Reserved Bit
;.equ	Res2	= 7	; Reserved Bit

