trol73/avr-make/asm/include/m256RFR2def.inc
; SCIRQM - Symbol Counter Interrupt Mask Register
.equ	IRQMCP1	= 0	; Symbol Counter Compare Match 1 IRQ enable
.equ	IRQMCP2	= 1	; Symbol Counter Compare Match 2 IRQ enable
.equ	IRQMCP3	= 2	; Symbol Counter Compare Match 3 IRQ enable
.equ	IRQMOF	= 3	; Symbol Counter Overflow IRQ enable
.equ	IRQMBO	= 4	; Backoff Slot Counter IRQ enable
;.equ	Res0	= 5	; Reserved Bit
;.equ	Res1	= 6	; Reserved Bit
;.equ	Res2	= 7	; Reserved Bit

; SCRSTRHH - Symbol Counter Received Frame Timestamp Register HH-Byte
.equ	SCRSTRHH0	= 0	; Symbol Counter Received Frame Timestamp Register HH-Byte
.equ	SCRSTRHH1	= 1	; Symbol Counter Received Frame Timestamp Register HH-Byte
.equ	SCRSTRHH2	= 2	; Symbol Counter Received Frame Timestamp Register HH-Byte
.equ	SCRSTRHH3	= 3	; Symbol Counter Received Frame Timestamp Register HH-Byte
.equ	SCRSTRHH4	= 4	; Symbol Counter Received Frame Timestamp Register HH-Byte
.equ	SCRSTRHH5	= 5	; Symbol Counter Received Frame Timestamp Register HH-Byte
.equ	SCRSTRHH6	= 6	; Symbol Counter Received Frame Timestamp Register HH-Byte
.equ	SCRSTRHH7	= 7	; Symbol Counter Received Frame Timestamp Register HH-Byte

; SCRSTRHL - Symbol Counter Received Frame Timestamp Register HL-Byte
.equ	SCRSTRHL0	= 0	; Symbol Counter Received Frame Timestamp Register HL-Byte
.equ	SCRSTRHL1	= 1	; Symbol Counter Received Frame Timestamp Register HL-Byte
.equ	SCRSTRHL2	= 2	; Symbol Counter Received Frame Timestamp Register HL-Byte
.equ	SCRSTRHL3	= 3	; Symbol Counter Received Frame Timestamp Register HL-Byte
.equ	SCRSTRHL4	= 4	; Symbol Counter Received Frame Timestamp Register HL-Byte
.equ	SCRSTRHL5	= 5	; Symbol Counter Received Frame Timestamp Register HL-Byte
.equ	SCRSTRHL6	= 6	; Symbol Counter Received Frame Timestamp Register HL-Byte
.equ	SCRSTRHL7	= 7	; Symbol Counter Received Frame Timestamp Register HL-Byte

; SCRSTRLH - Symbol Counter Received Frame Timestamp Register LH-Byte
.equ	SCRSTRLH0	= 0	; Symbol Counter Received Frame Timestamp Register LH-Byte
.equ	SCRSTRLH1	= 1	; Symbol Counter Received Frame Timestamp Register LH-Byte
.equ	SCRSTRLH2	= 2	; Symbol Counter Received Frame Timestamp Register LH-Byte
.equ	SCRSTRLH3	= 3	; Symbol Counter Received Frame Timestamp Register LH-Byte
.equ	SCRSTRLH4	= 4	; Symbol Counter Received Frame Timestamp Register LH-Byte
.equ	SCRSTRLH5	= 5	; Symbol Counter Received Frame Timestamp Register LH-Byte
.equ	SCRSTRLH6	= 6	; Symbol Counter Received Frame Timestamp Register LH-Byte
.equ	SCRSTRLH7	= 7	; Symbol Counter Received Frame Timestamp Register LH-Byte

; SCRSTRLL - Symbol Counter Received Frame Timestamp Register LL-Byte
.equ	SCRSTRLL0	= 0	; Symbol Counter Received Frame Timestamp Register LL-Byte
.equ	SCRSTRLL1	= 1	; Symbol Counter Received Frame Timestamp Register LL-Byte
.equ	SCRSTRLL2	= 2	; Symbol Counter Received Frame Timestamp Register LL-Byte
.equ	SCRSTRLL3	= 3	; Symbol Counter Received Frame Timestamp Register LL-Byte
.equ	SCRSTRLL4	= 4	; Symbol Counter Received Frame Timestamp Register LL-Byte
.equ	SCRSTRLL5	= 5	; Symbol Counter Received Frame Timestamp Register LL-Byte
.equ	SCRSTRLL6	= 6	; Symbol Counter Received Frame Timestamp Register LL-Byte
.equ	SCRSTRLL7	= 7	; Symbol Counter Received Frame Timestamp Register LL-Byte


; ***** EEPROM ***********************
; EEARH - EEPROM Address Register High Byte
.equ	EEAR8	= 0	; EEPROM Address
.equ	EEAR9	= 1	; EEPROM Address
.equ	EEAR10	= 2	; EEPROM Address
.equ	EEAR11	= 3	; EEPROM Address
;.equ	Res0	= 4	; Reserved
;.equ	Res1	= 5	; Reserved
;.equ	Res2	= 6	; Reserved
;.equ	Res3	= 7	; Reserved

; EEARL - EEPROM Address Register Low Byte
.equ	EEAR0	= 0	; EEPROM Address
.equ	EEAR1	= 1	; EEPROM Address
.equ	EEAR2	= 2	; EEPROM Address
.equ	EEAR3	= 3	; EEPROM Address
.equ	EEAR4	= 4	; EEPROM Address
.equ	EEAR5	= 5	; EEPROM Address
.equ	EEAR6	= 6	; EEPROM Address
.equ	EEAR7	= 7	; EEPROM Address

; EEDR - EEPROM Data Register
.equ	EEDR0	= 0	; EEPROM Data
.equ	EEDR1	= 1	; EEPROM Data
.equ	EEDR2	= 2	; EEPROM Data
.equ	EEDR3	= 3	; EEPROM Data
.equ	EEDR4	= 4	; EEPROM Data
.equ	EEDR5	= 5	; EEPROM Data
.equ	EEDR6	= 6	; EEPROM Data
.equ	EEDR7	= 7	; EEPROM Data

; EECR - EEPROM Control Register
.equ	EERE	= 0	; EEPROM Read Enable
.equ	EEPE	= 1	; EEPROM Programming Enable
.equ	EEMPE	= 2	; EEPROM Master Write Enable
.equ	EERIE	= 3	; EEPROM Ready Interrupt Enable
.equ	EEPM0	= 4	; EEPROM Programming Mode
.equ	EEPM1	= 5	; EEPROM Programming Mode
;.equ	Res0	= 6	; Reserved
;.equ	Res1	= 7	; Reserved


; ***** JTAG *************************
; OCDR - On-Chip Debug Register
.equ	OCDR0	= 0	; On-Chip Debug Register Data
.equ	OCDR1	= 1	; On-Chip Debug Register Data
.equ	OCDR2	= 2	; On-Chip Debug Register Data
.equ	OCDR3	= 3	; On-Chip Debug Register Data
.equ	OCDR4	= 4	; On-Chip Debug Register Data
.equ	OCDR5	= 5	; On-Chip Debug Register Data
.equ	OCDR6	= 6	; On-Chip Debug Register Data
.equ	OCDR7	= 7	; On-Chip Debug Register Data
.equ	IDRD	= OCDR7	; For compatibility

; MCUCR - MCU Control Register
.equ	JTD	= 7	; JTAG Interface Disable

; MCUSR - MCU Status Register
.equ	JTRF	= 4	; JTAG Reset Flag


; ***** EXTERNAL_INTERRUPT ***********
; EICRA - External Interrupt Control Register A
.equ	ISC00	= 0	; External Interrupt 0 Sense Control Bit
.equ	ISC01	= 1	; External Interrupt 0 Sense Control Bit
.equ	ISC10	= 2	; External Interrupt 1 Sense Control Bit
.equ	ISC11	= 3	; External Interrupt 1 Sense Control Bit
.equ	ISC20	= 4	; External Interrupt 2 Sense Control Bit
.equ	ISC21	= 5	; External Interrupt 2 Sense Control Bit
.equ	ISC30	= 6	; External Interrupt 3 Sense Control Bit
.equ	ISC31	= 7	; External Interrupt 3 Sense Control Bit

; EICRB - External Interrupt Control Register B
.equ	ISC40	= 0	; External Interrupt 4 Sense Control Bit
.equ	ISC41	= 1	; External Interrupt 4 Sense Control Bit
.equ	ISC50	= 2	; External Interrupt 5 Sense Control Bit
.equ	ISC51	= 3	; External Interrupt 5 Sense Control Bit
.equ	ISC60	= 4	; External Interrupt 6 Sense Control Bit
.equ	ISC61	= 5	; External Interrupt 6 Sense Control Bit
.equ	ISC70	= 6	; External Interrupt 7 Sense Control Bit
.equ	ISC71	= 7	; External Interrupt 7 Sense Control Bit

; EIMSK - External Interrupt Mask Register
.equ	INT0	= 0	; External Interrupt Request Enable
.equ	INT1	= 1	; External Interrupt Request Enable
.equ	INT2	= 2	; External Interrupt Request Enable
.equ	INT3	= 3	; External Interrupt Request Enable
.equ	INT4	= 4	; External Interrupt Request Enable
.equ	INT5	= 5	; External Interrupt Request Enable
.equ	INT6	= 6	; External Interrupt Request Enable
.equ	INT7	= 7	; External Interrupt Request Enable

; EIFR - External Interrupt Flag Register
.equ	INTF0	= 0	; External Interrupt Flag
.equ	INTF1	= 1	; External Interrupt Flag
.equ	INTF2	= 2	; External Interrupt Flag
.equ	INTF3	= 3	; External Interrupt Flag
.equ	INTF4	= 4	; External Interrupt Flag
.equ	INTF5	= 5	; External Interrupt Flag
.equ	INTF6	= 6	; External Interrupt Flag
.equ	INTF7	= 7	; External Interrupt Flag

; PCICR - Pin Change Interrupt Control Register
.equ	PCIE0	= 0	; Pin Change Interrupt Enable 0
.equ	PCIE1	= 1	; Pin Change Interrupt Enable 1
.equ	PCIE2	= 2	; Pin Change Interrupt Enable 2
;.equ	Res0	= 3	; Reserved Bit
;.equ	Res1	= 4	; Reserved Bit
;.equ	Res2	= 5	; Reserved Bit
;.equ	Res3	= 6	; Reserved Bit
;.equ	Res4	= 7	; Reserved Bit

; PCIFR - Pin Change Interrupt Flag Register
.equ	PCIF0	= 0	; Pin Change Interrupt Flag 0
.equ	PCIF1	= 1	; Pin Change Interrupt Flag 1
.equ	PCIF2	= 2	; Pin Change Interrupt Flag 2
;.equ	Res0	= 3	; Reserved Bit
;.equ	Res1	= 4	; Reserved Bit
;.equ	Res2	= 5	; Reserved Bit
;.equ	Res3	= 6	; Reserved Bit
;.equ	Res4	= 7	; Reserved Bit

; PCMSK2 - Pin Change Mask Register 2
.equ	PCINT16	= 0	; Pin Change Enable Mask
.equ	PCINT17	= 1	; Pin Change Enable Mask
.equ	PCINT18	= 2	; Pin Change Enable Mask
.equ	PCINT19	= 3	; Pin Change Enable Mask
.equ	PCINT20	= 4	; Pin Change Enable Mask
.equ	PCINT21	= 5	; Pin Change Enable Mask
.equ	PCINT22	= 6	; Pin Change Enable Mask
.equ	PCINT23	= 7	; Pin Change Enable Mask

; PCMSK1 - Pin Change Mask Register 1
.equ	PCINT8	= 0	; Pin Change Enable Mask 8
.equ	PCINT9	= 1	; Pin Change Enable Mask
.equ	PCINT10	= 2	; Pin Change Enable Mask
.equ	PCINT11	= 3	; Pin Change Enable Mask
.equ	PCINT12	= 4	; Pin Change Enable Mask
.equ	PCINT13	= 5	; Pin Change Enable Mask
.equ	PCINT14	= 6	; Pin Change Enable Mask
.equ	PCINT15	= 7	; Pin Change Enable Mask

; PCMSK0 - Pin Change Mask Register 0
.equ	PCINT0	= 0	; Pin Change Enable Mask
.equ	PCINT1	= 1	; Pin Change Enable Mask
.equ	PCINT2	= 2	; Pin Change Enable Mask
.equ	PCINT3	= 3	; Pin Change Enable Mask
.equ	PCINT4	= 4	; Pin Change Enable Mask
.equ	PCINT5	= 5	; Pin Change Enable Mask
.equ	PCINT6	= 6	; Pin Change Enable Mask
.equ	PCINT7	= 7	; Pin Change Enable Mask


; ***** AD_CONVERTER *****************
; ADMUX - The ADC Multiplexer Selection Register
.equ	MUX0	= 0	; Analog Channel and Gain Selection Bits
.equ	MUX1	= 1	; Analog Channel and Gain Selection Bits
.equ	MUX2	= 2	; Analog Channel and Gain Selection Bits
.equ	MUX3	= 3	; Analog Channel and Gain Selection Bits
.equ	MUX4	= 4	; Analog Channel and Gain Selection Bits
.equ	ADLAR	= 5	; ADC Left Adjust Result
.equ	REFS0	= 6	; Reference Selection Bits
.equ	REFS1	= 7	; Reference Selection Bits

; ADCSRA - The ADC Control and Status Register A
.equ	ADPS0	= 0	; ADC  Prescaler Select Bits
.equ	ADPS1	= 1	; ADC  Prescaler Select Bits
.equ	ADPS2	= 2	; ADC  Prescaler Select Bits
.equ	ADIE	= 3	; ADC Interrupt Enable
.equ	ADIF	= 4	; ADC Interrupt Flag
.equ	ADATE	= 5	; ADC Auto Trigger Enable
.equ	ADSC	= 6	; ADC Start Conversion
.equ	ADEN	= 7	; ADC Enable

; ADCSRB - The ADC Control and Status Register B
.equ	ADTS0	= 0	; ADC Auto Trigger Source
.equ	ADTS1	= 1	; ADC Auto Trigger Source
.equ	ADTS2	= 2	; ADC Auto Trigger Source
.equ	MUX5	= 3	; Analog Channel and Gain Selection Bits
.equ	ACCH	= 4	; Analog Channel Change
.equ	REFOK	= 5	; Reference Voltage OK
;.equ	ACME	= 6	; Analog Comparator Multiplexer Enable
.equ	AVDDOK	= 7	; AVDD Supply Voltage OK

; ADCSRC - The ADC Control and Status Register C
.equ	ADSUT0	= 0	; ADC Start-up Time
.equ	ADSUT1	= 1	; ADC Start-up Time
.equ	ADSUT2	= 2	; ADC Start-up Time
.equ	ADSUT3	= 3	; ADC Start-up Time
.equ	ADSUT4	= 4	; ADC Start-up Time
;.equ	Res0	= 5	; Reserved
.equ	ADTHT0	= 6	; ADC Track-and-Hold Time
.equ	ADTHT1	= 7	; ADC Track-and-Hold Time

; ADCH - ADC Data Register High Byte
.equ	ADCH0	= 0	; ADC Data Register High Byte
.equ	ADCH1	= 1	; ADC Data Register High Byte
.equ	ADCH2	= 2	; ADC Data Register High Byte
.equ	ADCH3	= 3	; ADC Data Register High Byte
.equ	ADCH4	= 4	; ADC Data Register High Byte
.equ	ADCH5	= 5	; ADC Data Register High Byte
.equ	ADCH6	= 6	; ADC Data Register High Byte
.equ	ADCH7	= 7	; ADC Data Register High Byte

; ADCL - ADC Data Register Low Byte
.equ	ADCL0	= 0	; ADC Data Register Low Byte
.equ	ADCL1	= 1	; ADC Data Register Low Byte
.equ	ADCL2	= 2	; ADC Data Register Low Byte
.equ	ADCL3	= 3	; ADC Data Register Low Byte
.equ	ADCL4	= 4	; ADC Data Register Low Byte
.equ	ADCL5	= 5	; ADC Data Register Low Byte
.equ	ADCL6	= 6	; ADC Data Register Low Byte
.equ	ADCL7	= 7	; ADC Data Register Low Byte

; DIDR0 - Digital Input Disable Register 0
.equ	ADC0D	= 0	; Disable ADC7:0 Digital Input
.equ	ADC1D	= 1	; Disable ADC7:0 Digital Input
.equ	ADC2D	= 2	; Disable ADC7:0 Digital Input
.equ	ADC3D	= 3	; Disable ADC7:0 Digital Input
.equ	ADC4D	= 4	; Disable ADC7:0 Digital Input
.equ	ADC5D	= 5	; Disable ADC7:0 Digital Input
.equ	ADC6D	= 6	; Disable ADC7:0 Digital Input
.equ	ADC7D	= 7	; Disable ADC7:0 Digital Input

