trol73/avr-make/asm/include/m256RFR2def.inc
; DIDR2 - Digital Input Disable Register 2
.equ	ADC8D	= 0	; Reserved Bits
.equ	ADC9D	= 1	; Reserved Bits
.equ	ADC10D	= 2	; Reserved Bits
.equ	ADC11D	= 3	; Reserved Bits
.equ	ADC12D	= 4	; Reserved Bits
.equ	ADC13D	= 5	; Reserved Bits
.equ	ADC14D	= 6	; Reserved Bits
.equ	ADC15D	= 7	; Reserved Bits


; ***** BOOT_LOAD ********************
; SPMCSR - Store Program Memory Control Register
.equ	SPMEN	= 0	; Store Program Memory Enable
.equ	PGERS	= 1	; Page Erase
.equ	PGWRT	= 2	; Page Write
.equ	BLBSET	= 3	; Boot Lock Bit Set
.equ	RWWSRE	= 4	; Read While Write Section Read Enable
.equ	SIGRD	= 5	; Signature Row Read
.equ	RWWSB	= 6	; Read While Write Section Busy
.equ	SPMIE	= 7	; SPM Interrupt Enable


; ***** CPU **************************
; SREG - Status Register
.equ	SREG_C	= 0	; Carry Flag
.equ	SREG_Z	= 1	; Zero Flag
.equ	SREG_N	= 2	; Negative Flag
.equ	SREG_V	= 3	; Two's Complement Overflow Flag
.equ	SREG_S	= 4	; Sign Bit
.equ	SREG_H	= 5	; Half Carry Flag
.equ	SREG_T	= 6	; Bit Copy Storage
.equ	SREG_I	= 7	; Global Interrupt Enable

; MCUCR - MCU Control Register
.equ	IVCE	= 0	; Interrupt Vector Change Enable
.equ	IVSEL	= 1	; Interrupt Vector Select
;.equ	Res0	= 2	; Reserved
;.equ	Res1	= 3	; Reserved
.equ	PUD	= 4	; Pull-up Disable
;.equ	Res0	= 5	; Reserved
;.equ	Res1	= 6	; Reserved
;.equ	JTD	= 7	; JTAG Interface Disable

; MCUSR - MCU Status Register
.equ	PORF	= 0	; Power-on Reset Flag
.equ	EXTRF	= 1	; External Reset Flag
.equ	BORF	= 2	; Brown-out Reset Flag
.equ	WDRF	= 3	; Watchdog Reset Flag
;.equ	JTRF	= 4	; JTAG Reset Flag
;.equ	Res0	= 5	; Reserved
;.equ	Res1	= 6	; Reserved
;.equ	Res2	= 7	; Reserved

; OSCCAL - Oscillator Calibration Value
.equ	CAL0	= 0	; Oscillator Calibration Tuning Value
.equ	CAL1	= 1	; Oscillator Calibration Tuning Value
.equ	CAL2	= 2	; Oscillator Calibration Tuning Value
.equ	CAL3	= 3	; Oscillator Calibration Tuning Value
.equ	CAL4	= 4	; Oscillator Calibration Tuning Value
.equ	CAL5	= 5	; Oscillator Calibration Tuning Value
.equ	CAL6	= 6	; Oscillator Calibration Tuning Value
.equ	CAL7	= 7	; Oscillator Calibration Tuning Value

; CLKPR - Clock Prescale Register
.equ	CLKPS0	= 0	; Clock Prescaler Select Bits
.equ	CLKPS1	= 1	; Clock Prescaler Select Bits
.equ	CLKPS2	= 2	; Clock Prescaler Select Bits
.equ	CLKPS3	= 3	; Clock Prescaler Select Bits
;.equ	Res0	= 4	; Reserved
;.equ	Res1	= 5	; Reserved
;.equ	Res2	= 6	; Reserved
.equ	CLKPCE	= 7	; Clock Prescaler Change Enable

; SMCR - Sleep Mode Control Register
.equ	SE	= 0	; Sleep Enable
.equ	SM0	= 1	; Sleep Mode Select bit 0
.equ	SM1	= 2	; Sleep Mode Select bit 1
.equ	SM2	= 3	; Sleep Mode Select bit 2
;.equ	Res0	= 4	; Reserved
;.equ	Res1	= 5	; Reserved
;.equ	Res2	= 6	; Reserved
;.equ	Res3	= 7	; Reserved

; RAMPZ - Extended Z-pointer Register for ELPM/SPM
.equ	RAMPZ0	= 0	; Extended Z-Pointer Value
.equ	RAMPZ1	= 1	; Extended Z-Pointer Value
;.equ	Res0	= 2	; Reserved
;.equ	Res1	= 3	; Reserved
;.equ	Res2	= 4	; Reserved
;.equ	Res3	= 5	; Reserved
;.equ	Res4	= 6	; Reserved
;.equ	Res5	= 7	; Reserved

; EIND - Extended Indirect Register
.equ	EIND0	= 0	; Bit 0

; GPIOR2 - General Purpose I/O Register 2
.equ	GPIOR20	= 0	; General Purpose I/O Register 2 Value
.equ	GPIOR21	= 1	; General Purpose I/O Register 2 Value
.equ	GPIOR22	= 2	; General Purpose I/O Register 2 Value
.equ	GPIOR23	= 3	; General Purpose I/O Register 2 Value
.equ	GPIOR24	= 4	; General Purpose I/O Register 2 Value
.equ	GPIOR25	= 5	; General Purpose I/O Register 2 Value
.equ	GPIOR26	= 6	; General Purpose I/O Register 2 Value
.equ	GPIOR27	= 7	; General Purpose I/O Register 2 Value

; GPIOR1 - General Purpose IO Register 1
.equ	GPIOR10	= 0	; General Purpose I/O Register 1 Value
.equ	GPIOR11	= 1	; General Purpose I/O Register 1 Value
.equ	GPIOR12	= 2	; General Purpose I/O Register 1 Value
.equ	GPIOR13	= 3	; General Purpose I/O Register 1 Value
.equ	GPIOR14	= 4	; General Purpose I/O Register 1 Value
.equ	GPIOR15	= 5	; General Purpose I/O Register 1 Value
.equ	GPIOR16	= 6	; General Purpose I/O Register 1 Value
.equ	GPIOR17	= 7	; General Purpose I/O Register 1 Value

; GPIOR0 - General Purpose IO Register 0
.equ	GPIOR00	= 0	; General Purpose I/O Register 0 Value
.equ	GPIOR01	= 1	; General Purpose I/O Register 0 Value
.equ	GPIOR02	= 2	; General Purpose I/O Register 0 Value
.equ	GPIOR03	= 3	; General Purpose I/O Register 0 Value
.equ	GPIOR04	= 4	; General Purpose I/O Register 0 Value
.equ	GPIOR05	= 5	; General Purpose I/O Register 0 Value
.equ	GPIOR06	= 6	; General Purpose I/O Register 0 Value
.equ	GPIOR07	= 7	; General Purpose I/O Register 0 Value

; PRR2 - Power Reduction Register 2
.equ	PRRAM0	= 0	; Power Reduction SRAM 0
.equ	PRRAM1	= 1	; Power Reduction SRAM 1
.equ	PRRAM2	= 2	; Power Reduction SRAM 2
.equ	PRRAM3	= 3	; Power Reduction SRAM 3
;.equ	Res0	= 4	; Reserved Bit
;.equ	Res1	= 5	; Reserved Bit
;.equ	Res2	= 6	; Reserved Bit
;.equ	Res3	= 7	; Reserved Bit

; PRR1 - Power Reduction Register 1
.equ	PRUSART1	= 0	; Power Reduction USART1
.equ	PRTIM3	= 3	; Power Reduction Timer/Counter3
.equ	PRTIM4	= 4	; Power Reduction Timer/Counter4
.equ	PRTIM5	= 5	; Power Reduction Timer/Counter5
.equ	PRTRX24	= 6	; Power Reduction Transceiver
;.equ	Res	= 7	; Reserved Bit

; PRR0 - Power Reduction Register0
.equ	PRADC	= 0	; Power Reduction ADC
.equ	PRUSART0	= 1	; Power Reduction USART
.equ	PRSPI	= 2	; Power Reduction Serial Peripheral Interface
.equ	PRTIM1	= 3	; Power Reduction Timer/Counter1
.equ	PRPGA	= 4	; Power Reduction PGA
.equ	PRTIM0	= 5	; Power Reduction Timer/Counter0
.equ	PRTIM2	= 6	; Power Reduction Timer/Counter2
.equ	PRTWI	= 7	; Power Reduction TWI


; ***** FLASH ************************
; NEMCR - Flash Extended-Mode Control-Register
.equ	AEAM0	= 4	; Address for Extended Address Mode of Extra Rows
.equ	AEAM1	= 5	; Address for Extended Address Mode of Extra Rows
.equ	ENEAM	= 6	; Enable Extended Address Mode for Extra Rows

; BGCR - Reference Voltage Calibration Register
.equ	BGCAL0	= 0	; Coarse Calibration Bits
.equ	BGCAL1	= 1	; Coarse Calibration Bits
.equ	BGCAL2	= 2	; Coarse Calibration Bits
.equ	BGCAL_FINE0	= 3	; Fine Calibration Bits
.equ	BGCAL_FINE1	= 4	; Fine Calibration Bits
.equ	BGCAL_FINE2	= 5	; Fine Calibration Bits
.equ	BGCAL_FINE3	= 6	; Fine Calibration Bits
;.equ	Res	= 7	; Reserved Bit


; ***** PWRCTRL **********************
; TRXPR - Transceiver Pin Register
.equ	TRXRST	= 0	; Force Transceiver Reset
.equ	SLPTR	= 1	; Multi-purpose Transceiver Control Bit
;.equ	Res0	= 4	; Reserved
;.equ	Res1	= 5	; Reserved
;.equ	Res2	= 6	; Reserved
;.equ	Res3	= 7	; Reserved

; DRTRAM0 - Data Retention Configuration Register #0
.equ	ENDRT	= 4	; Enable SRAM Data Retention
.equ	DRTSWOK	= 5	; DRT Switch OK
;.equ	Res0	= 6	; Reserved
;.equ	Res1	= 7	; Reserved

; DRTRAM1 - Data Retention Configuration Register #1
;.equ	ENDRT	= 4	; Enable SRAM Data Retention
;.equ	DRTSWOK	= 5	; DRT Switch OK
;.equ	Res0	= 6	; Reserved
;.equ	Res1	= 7	; Reserved

; DRTRAM2 - Data Retention Configuration Register #2
;.equ	ENDRT	= 4	; Enable SRAM Data Retention
;.equ	DRTSWOK	= 5	; DRT Switch OK
;.equ	Res	= 6	; Reserved Bit

; DRTRAM3 - Data Retention Configuration Register #3
;.equ	ENDRT	= 4	; Enable SRAM Data Retention
;.equ	DRTSWOK	= 5	; DRT Switch OK
;.equ	Res0	= 6	; Reserved
;.equ	Res1	= 7	; Reserved

