trol73/avr-make/asm/include/m256RFR2def.inc
; LLDRL - Low Leakage Voltage Regulator Data Register (Low-Byte)
.equ	LLDRL0	= 0	; Low-Byte Data Register Bits
.equ	LLDRL1	= 1	; Low-Byte Data Register Bits
.equ	LLDRL2	= 2	; Low-Byte Data Register Bits
.equ	LLDRL3	= 3	; Low-Byte Data Register Bits
;.equ	Res0	= 4	; Reserved
;.equ	Res1	= 5	; Reserved
;.equ	Res2	= 6	; Reserved
;.equ	Res3	= 7	; Reserved

; LLDRH - Low Leakage Voltage Regulator Data Register (High-Byte)
.equ	LLDRH0	= 0	; High-Byte Data Register Bits
.equ	LLDRH1	= 1	; High-Byte Data Register Bits
.equ	LLDRH2	= 2	; High-Byte Data Register Bits
.equ	LLDRH3	= 3	; High-Byte Data Register Bits
.equ	LLDRH4	= 4	; High-Byte Data Register Bits
;.equ	Res0	= 5	; Reserved
;.equ	Res1	= 6	; Reserved
;.equ	Res2	= 7	; Reserved

; LLCR - Low Leakage Voltage Regulator Control Register
.equ	LLENCAL	= 0	; Enable Automatic Calibration
.equ	LLSHORT	= 1	; Short Lower Calibration Circuit
.equ	LLTCO	= 2	; Temperature Coefficient of Current Source
.equ	LLCAL	= 3	; Calibration Active
.equ	LLCOMP	= 4	; Comparator Output
.equ	LLDONE	= 5	; Calibration Done
;.equ	Res0	= 6	; Reserved Bit
;.equ	Res1	= 7	; Reserved Bit

; DPDS0 - Port Driver Strength Register 0
.equ	PBDRV0	= 0	; Driver Strength Port B
.equ	PBDRV1	= 1	; Driver Strength Port B
.equ	PDDRV0	= 2	; Driver Strength Port D
.equ	PDDRV1	= 3	; Driver Strength Port D
.equ	PEDRV0	= 4	; Driver Strength Port E
.equ	PEDRV1	= 5	; Driver Strength Port E
.equ	PFDRV0	= 6	; Driver Strength Port F
.equ	PFDRV1	= 7	; Driver Strength Port F

; DPDS1 - Port Driver Strength Register 1
.equ	PGDRV0	= 0	; Driver Strength Port G
.equ	PGDRV1	= 1	; Driver Strength Port G
;.equ	Res0	= 2	; Reserved
;.equ	Res1	= 3	; Reserved
;.equ	Res2	= 4	; Reserved
;.equ	Res3	= 5	; Reserved
;.equ	Res4	= 6	; Reserved
;.equ	Res5	= 7	; Reserved

; MCUCR - MCU Control Register
;.equ	PUD	= 4	; Pull-up Disable


; ***** USART0_SPI *******************
; UCSR0A - USART0 MSPIM Control and Status Register A
;.equ	UDRE0	= 5	; USART Data Register Empty
;.equ	TXC0	= 6	; USART Transmit Complete
;.equ	RXC0	= 7	; USART Receive Complete

; UCSR0B - USART0 MSPIM Control and Status Register B
;.equ	TXEN0	= 3	; Transmitter Enable
;.equ	RXEN0	= 4	; Receiver Enable
;.equ	UDRIE0	= 5	; USART Data Register Empty Interrupt Enable
;.equ	TXCIE0	= 6	; TX Complete Interrupt Enable
;.equ	RXCIE0	= 7	; RX Complete Interrupt Enable

; UCSR0C - USART0 MSPIM Control and Status Register C
;.equ	UCPOL0	= 0	; Clock Polarity
;.equ	UCPHA0	= 1	; Clock Phase
;.equ	UCSZ00	= UCPHA0	; For compatibility
;.equ	UDORD0	= 2	; Data Order
;.equ	UCSZ01	= UDORD0	; For compatibility


; ***** USART1_SPI *******************
; UCSR1A - USART1 MSPIM Control and Status Register A
;.equ	UDRE1	= 5	; USART Data Register Empty
;.equ	TXC1	= 6	; USART Transmit Complete
;.equ	RXC1	= 7	; USART Receive Complete

; UCSR1B - USART1 MSPIM Control and Status Register B
;.equ	TXEN1	= 3	; Transmitter Enable
;.equ	RXEN1	= 4	; Receiver Enable
;.equ	UDRIE1	= 5	; USART Data Register Empty Interrupt Enable
;.equ	TXCIE1	= 6	; TX Complete Interrupt Enable
;.equ	RXCIE1	= 7	; RX Complete Interrupt Enable

; UCSR1C - USART1 MSPIM Control and Status Register C
;.equ	UCPOL1	= 0	; Clock Polarity
;.equ	UCPHA1	= 1	; Clock Phase
;.equ	UCSZ10	= UCPHA1	; For compatibility
;.equ	UDORD1	= 2	; Data Order
;.equ	UCSZ11	= UDORD1	; For compatibility



; ***** LOCKSBITS ********************************************************
.equ	LB1	= 0	; Lock bit
.equ	LB2	= 1	; Lock bit
.equ	BLB01	= 2	; Boot Lock bit
.equ	BLB02	= 3	; Boot Lock bit
.equ	BLB11	= 4	; Boot lock bit
.equ	BLB12	= 5	; Boot lock bit


; ***** FUSES ************************************************************
; LOW fuse bits
.equ	CKSEL0	= 0	; Select Clock Source
.equ	CKSEL1	= 1	; Select Clock Source
.equ	CKSEL2	= 2	; Select Clock Source
.equ	CKSEL3	= 3	; Select Clock Source
.equ	SUT0	= 4	; Select start-up time
.equ	SUT1	= 5	; Select start-up time
.equ	CKOUT	= 6	; Clock output
.equ	CKDIV8	= 7	; Divide clock by 8

; HIGH fuse bits
.equ	BOOTRST	= 0	; Select Reset Vector
.equ	BOOTSZ0	= 1	; Select Boot Size
.equ	BOOTSZ1	= 2	; Select Boot Size
.equ	EESAVE	= 3	; EEPROM memory is preserved through chip erase
.equ	WDTON	= 4	; Watchdog timer always on
.equ	SPIEN	= 5	; Enable Serial programming and Data Downloading
.equ	JTAGEN	= 6	; Enable JTAG
.equ	OCDEN	= 7	; Enable OCD

; EXTENDED fuse bits
.equ	BODLEVEL0	= 0	; Brown-out Detector trigger level
.equ	BODLEVEL1	= 1	; Brown-out Detector trigger level
.equ	BODLEVEL2	= 2	; Brown-out Detector trigger level



; ***** CPU REGISTER DEFINITIONS *****************************************
.def	XH	= r27
.def	XL	= r26
.def	YH	= r29
.def	YL	= r28
.def	ZH	= r31
.def	ZL	= r30



; ***** DATA MEMORY DECLARATIONS *****************************************
.equ	FLASHEND	= 0x1ffff	; Note: Word address
.equ	IOEND	= 0x01ff
.equ	SRAM_START	= 0x0200
.equ	SRAM_SIZE	= 32768
.equ	RAMEND	= 0x81ff
.equ	XRAMEND	= 0x0000
.equ	E2END	= 0x1fff
.equ	EEPROMEND	= 0x1fff
.equ	EEADRBITS	= 13
#pragma AVRPART MEMORY PROG_FLASH 262144
#pragma AVRPART MEMORY EEPROM 8192
#pragma AVRPART MEMORY INT_SRAM SIZE 32768
#pragma AVRPART MEMORY INT_SRAM START_ADDR 0x200



; ***** BOOTLOADER DECLARATIONS ******************************************
.equ	NRWW_START_ADDR	= 0x1f000
.equ	NRWW_STOP_ADDR	= 0x1ffff
.equ	RWW_START_ADDR	= 0x0
.equ	RWW_STOP_ADDR	= 0x1efff
.equ	PAGESIZE	= 128
.equ	FIRSTBOOTSTART	= 0x1fe00
.equ	SECONDBOOTSTART	= 0x1fc00
.equ	THIRDBOOTSTART	= 0x1f800
.equ	FOURTHBOOTSTART	= 0x1f000
.equ	SMALLBOOTSTART	= FIRSTBOOTSTART
.equ	LARGEBOOTSTART	= FOURTHBOOTSTART



; ***** INTERRUPT VECTORS ************************************************
.equ	INT0addr	= 0x0002	; External Interrupt Request 0
.equ	INT1addr	= 0x0004	; External Interrupt Request 1
.equ	INT2addr	= 0x0006	; External Interrupt Request 2
.equ	INT3addr	= 0x0008	; External Interrupt Request 3
.equ	INT4addr	= 0x000a	; External Interrupt Request 4
.equ	INT5addr	= 0x000c	; External Interrupt Request 5
.equ	INT6addr	= 0x000e	; External Interrupt Request 6
.equ	INT7addr	= 0x0010	; External Interrupt Request 7
.equ	PCI0addr	= 0x0012	; Pin Change Interrupt Request 0
.equ	PCI1addr	= 0x0014	; Pin Change Interrupt Request 1
.equ	PCI2addr	= 0x0016	; Pin Change Interrupt Request 2
.equ	WDTaddr	= 0x0018	; Watchdog Time-out Interrupt
.equ	OC2Aaddr	= 0x001a	; Timer/Counter2 Compare Match A
.equ	OC2Baddr	= 0x001c	; Timer/Counter2 Compare Match B
.equ	OVF2addr	= 0x001e	; Timer/Counter2 Overflow
.equ	ICP1addr	= 0x0020	; Timer/Counter1 Capture Event
.equ	OC1Aaddr	= 0x0022	; Timer/Counter1 Compare Match A
.equ	OC1Baddr	= 0x0024	; Timer/Counter1 Compare Match B
.equ	OC1Caddr	= 0x0026	; Timer/Counter1 Compare Match C
.equ	OVF1addr	= 0x0028	; Timer/Counter1 Overflow
.equ	OC0Aaddr	= 0x002a	; Timer/Counter0 Compare Match A
.equ	OC0Baddr	= 0x002c	; Timer/Counter0 Compare Match B
.equ	OVF0addr	= 0x002e	; Timer/Counter0 Overflow
.equ	SPIaddr	= 0x0030	; SPI Serial Transfer Complete
.equ	URXC0addr	= 0x0032	; USART0, Rx Complete
.equ	UDRE0addr	= 0x0034	; USART0 Data register Empty
.equ	UTXC0addr	= 0x0036	; USART0, Tx Complete
.equ	ACIaddr	= 0x0038	; Analog Comparator
.equ	ADCCaddr	= 0x003a	; ADC Conversion Complete
.equ	ERDYaddr	= 0x003c	; EEPROM Ready
.equ	ICP3addr	= 0x003e	; Timer/Counter3 Capture Event
.equ	OC3Aaddr	= 0x0040	; Timer/Counter3 Compare Match A
.equ	OC3Baddr	= 0x0042	; Timer/Counter3 Compare Match B
.equ	OC3Caddr	= 0x0044	; Timer/Counter3 Compare Match C
.equ	OVF3addr	= 0x0046	; Timer/Counter3 Overflow
.equ	URXC1addr	= 0x0048	; USART1, Rx Complete
.equ	UDRE1addr	= 0x004a	; USART1 Data register Empty
.equ	UTXC1addr	= 0x004c	; USART1, Tx Complete
.equ	TWIaddr	= 0x004e	; 2-wire Serial Interface
.equ	SPMRaddr	= 0x0050	; Store Program Memory Read
.equ	ICP4addr	= 0x0052	; Timer/Counter4 Capture Event
.equ	OC4Aaddr	= 0x0054	; Timer/Counter4 Compare Match A
.equ	OC4Baddr	= 0x0056	; Timer/Counter4 Compare Match B
.equ	OC4Caddr	= 0x0058	; Timer/Counter4 Compare Match C
.equ	OVF4addr	= 0x005a	; Timer/Counter4 Overflow
.equ	ICP5addr	= 0x005c	; Timer/Counter5 Capture Event
.equ	OC5Aaddr	= 0x005e	; Timer/Counter5 Compare Match A
.equ	OC5Baddr	= 0x0060	; Timer/Counter5 Compare Match B
.equ	OC5Caddr	= 0x0062	; Timer/Counter5 Compare Match C
.equ	OVF5addr	= 0x0064	; Timer/Counter5 Overflow
.equ	URXC2addr	= 0x0066	; USART2, Rx Complete
.equ	UDRE2addr	= 0x0068	; USART2 Data register Empty
.equ	UTXC2addr	= 0x006a	; USART2, Tx Complete
.equ	URXC3addr	= 0x006c	; USART3, Rx Complete
.equ	UDRE3addr	= 0x006e	; USART3 Data register Empty
.equ	UTXC3addr	= 0x0070	; USART3, Tx Complete
.equ	TRX24_PLL_LOCKaddr	= 0x0072	; TRX24 - PLL lock interrupt
.equ	TRX24_PLL_UNLOCKaddr	= 0x0074	; TRX24 - PLL unlock interrupt
.equ	TRX24_RX_STARTaddr	= 0x0076	; TRX24 - Receive start interrupt
.equ	TRX24_RX_ENDaddr	= 0x0078	; TRX24 - RX_END interrupt
.equ	TRX24_CCA_ED_DONEaddr	= 0x007a	; TRX24 - CCA/ED done interrupt
.equ	TRX24_XAH_AMIaddr	= 0x007c	; TRX24 - XAH - AMI
.equ	TRX24_TX_ENDaddr	= 0x007e	; TRX24 - TX_END interrupt
.equ	TRX24_AWAKEaddr	= 0x0080	; TRX24 AWAKE - tranceiver is reaching state TRX_OFF
.equ	SCNT_CMP1addr	= 0x0082	; Symbol counter - compare match 1 interrupt
.equ	SCNT_CMP2addr	= 0x0084	; Symbol counter - compare match 2 interrupt
.equ	SCNT_CMP3addr	= 0x0086	; Symbol counter - compare match 3 interrupt
.equ	SCNT_OVFLaddr	= 0x0088	; Symbol counter - overflow interrupt
.equ	SCNT_BACKOFFaddr	= 0x008a	; Symbol counter - backoff interrupt
.equ	AES_READYaddr	= 0x008c	; AES engine ready interrupt
.equ	BAT_LOWaddr	= 0x008e	; Battery monitor indicates supply voltage below threshold
.equ	TRX24_TX_STARTaddr	= 0x0090	; TRX24 TX start interrupt
.equ	TRX24_AMI0addr	= 0x0092	; Address match interrupt of address filter 0
.equ	TRX24_AMI1addr	= 0x0094	; Address match interrupt of address filter 1
.equ	TRX24_AMI2addr	= 0x0096	; Address match interrupt of address filter 2
.equ	TRX24_AMI3addr	= 0x0098	; Address match interrupt of address filter 3

.equ	INT_VECTORS_SIZE	= 154	; size in words

#endif  /* _M256RFR2DEF_INC_ */

; ***** END OF FILE ******************************************************
